[
    {
        "date": "2024-06-14",
        "url": "https://www.himss.org/news/himss-cybersecurity-expert-lee-kim-running-isc2-board-directors",
        "title": "HIMSS Cybersecurity Expert Lee Kim Running for ISC2 Board of Directors",
        "content": "Lee Kim, HIMSS Senior Principal of Cybersecurity and Privacy, is running for the Board of Directors of ISC2, the world’s leading member association for cybersecurity professionals.Eligible ISC2 members in good standing canvote from June 18-July 2, 2024, for Kim to join the board.Kim is an industry-wide expert and educator in cybersecurity, data privacy, artificial intelligence, critical infrastructure and law.“Cyberattacks aren’t uniquely a healthcare problem, but the industry is a major target because of the abundance of financially valuable personal information,” Kimtold USA Today in a recent interview.Speaking with the Chicago Tribune, Kim illuminated the latest HIMSS Cybersecurity Survey Report, which she authors annually, explaining that the healthcare industry has slightly increased its spending on cybersecurity. “Healthcare is one of the very few industries where pretty much everyone is impacted when a cyberattack happens,” she said.Kim delivered a presentation on artificial intelligence, cybersecurity, data privacy, and future implications this May at the 2024 National Conference of AIIC (Associazione Italiana Ingegneri Clinici) in Rome.  She will serve as an expert panelist on a June 18 webinar on theuse of AI in healthcare and its cybersecurity implications, hosted by HIT Answers.Join Us as We Reimagine Health Through Information and TechnologyAt HIMSS, our vision is to realize the full health potential of every human, everywhere. Be part of the community that’s transforming the global health ecosystem with courage, curiosity and determination.Be part of what’s next for health"
    },
    {
        "date": "2024-06-14",
        "url": "https://www.himss.org/news/himss-recommends-onc-ensure-true-health-equity-design",
        "title": "HIMSS Recommends ONC Ensure True Health Equity by Design",
        "content": "HIMSS has delivered recommendations to the Office of the National Coordinator (ONC) for how diverse and underserved communities can be more preemptively engaged in the design, development and validation of health IT tools and systems.TheHealth Equity by Design Concept Paperdetails how ONC will use certification and other policy levers to ensure health equity is built into interoperable health information and technology systems.In a feedback letter to ONC, HIMSS offered recommendations to guide the office’s approach for addressing practical health IT coordination challenges facing underserved communities.Involvement of stakeholders from underserved patient populations from the beginning of the design, development and monitoring of health information and technology tools is critical for ensuring health equity.To facilitate engagement of these communities, HIMSS recommended ONC consider utilizing design thinking in the context of a learning health system framework to maximize equity focused innovation. User-centric design should be developed with a wide-range of health literacy and other capabilities of all patient populations.Scalable frameworks that consider the challenges faced by healthcare delivery sites focused on caring for underserved communities should be considered when health IT standards and systems are under development. HIMSS recommended that ONC include equity by design mechanisms through its federal coordination efforts, technical guidance and certification criteria specifications for equity metrics.To build trust in underserved communities, HIMSS called on ONC to improve and be more intentional when engaging in community collaboration with underserved communities, especially Tribal populations, when considering the design and implementation of health IT systems in a manner to promote health equity.HIMSS is invested in working with stakeholders across the sector to co-design actionable frameworks for industry and providers to incorporate health equity by design.To learn more about HIMSS efforts to promote health equity, please contact HIMSS Public Policy team atpolicy@himss.org.HIMSS Public Policy and AdvocacyThe HIMSS policy team works closely with the U.S. Congress, federal decision makers, state legislatures and governments, and other organizations to recommend policy, and legislative and regulatory solutions to improve health through information and technology.Help Advance Health IT Policy"
    },
    {
        "date": "2024-06-13",
        "url": "https://www.himss.org/news/apac-healthcare-professionals-invited-complete-emr-experience-survey",
        "title": "APAC Healthcare Professionals Invited to Complete EMR Experience Survey",
        "content": "HIMSS is seeking insights from healthcare professionals who work with Electronic Medical Records at healthcare provider organizations in the Asia-Pacific region for a survey about the challenges associated with EMR use and how value is measured.The first 200 qualified participants to complete the survey will receive a $50 USD Amazon gift voucher once the survey closes. For verification purposes, participants must complete the survey using a work email address.Take the HIMSS Asia-Pacific EMR Experience Survey.The deadline to complete the survey is 31 July 2024 or once 200 qualified responses are received.The survey aims to inform and empower healthcare organizations to implement strategies that alleviate challenges associated with EMR use and improve the way they benefit health professionals and patients.Preliminary findings of the HIMSS Asia-Pacific EMR Experience Survey will be presented at theHIMSS24 Asia-Pacific Conferencein Seoul, 1-4 October 2024, and the final report will be released in early 2025.Participation in this survey will contribute to shaping a healthcare environment that supports patient care and the wellbeing of health professionals through thoughtful EMR implementation.Join Us as We Reimagine Health Through Information and TechnologyAt HIMSS, our vision is to realize the full health potential of every human, everywhere. Be part of the community that’s transforming the global health ecosystem with courage, curiosity and determination.Be part of what’s next for health"
    },
    {
        "date": "2024-06-12",
        "url": "https://www.himss.org/news/cut-through-hype-2024-himss-ai-healthcare-forum",
        "title": "Cut Through the Hype at the 2024 HIMSS AI in Healthcare Forum",
        "content": "Healthcare and technology professionals will gather for two days of thought-provoking panels, visionary keynotes, expert-led education sessions, interactive networking, live solution demos, real-world case studies and more at the2024 HIMSS AI inHealthcare Forum, Sept. 5-6 in Boston.The AI in Healthcare Forum cuts through the hype to offer a comprehensive showcase of the transformative potential of AI in healthcare.Registration is openfor the most important AI event of the year dedicated to healthcare professionals.Keynotes will be delivered by Geeta Nayyar, best-selling author, technologist, chief medical officer of RadiantGraph; and Brian Anderson, president and CEO of Coalition for Health AI (CHAI) with Michael Pencina, chief data scientist at Duke University Health System.This year’s forum speakersalso include leaders and experts from Cleveland Clinic, Mayo Clinic Platform, Stanford Health Care, John Hopkins Medicine, Dana-Farber Cancer Institute, Mass General Brigham, Michigan Department of Health and Human Services and more.Esteemed panelists will explore the infrastructure necessary to power AI; the patient perspective on AI in healthcare; whether to use generative AI in healthcare; the navigation of ethics, regulation and innovation along the quest for AI governance; and lessons from the trenches when it comes to bringing AI to scale.Case studies will cover the use of AI in cybersecurity; the world’s first AI model for sepsis screening; generative AI in clinical workflows; and AI for overcoming healthcare’s mismatch between supply and demand.A speaker from the U.S. Department of Health and Human Services will deliver an updated look at the AI regulatory landscape.As generative AI continues to accelerate the pace of change in healthcare, it’s more important than ever to possess the knowledge, tools and confidence to navigate this complex landscape effectively.AI in Healthcare ForumEngage with experts at the forefront of innovation as they analyze the intricacies of integrating AI into healthcare settings. You’ll glean actionable insights from successful implementations and lessons learned from challenges encountered along the way.Register Now"
    },
    {
        "date": "2024-06-11",
        "url": "https://www.himss.org/news/himss-calls-significant-investment-public-health-data-modernization-annual-ipps-response",
        "title": "HIMSS Calls for Significant Investment for Public Health Data Modernization in Annual IPPS Response",
        "content": "HIMSS has reiterated its call for significant investment in public health information data modernization and interoperability capability.HIMSS submitted its call to action throughpublic commentsresponding to a request for information (RFI) from the Centers for Medicare and Medicaid Services about methods to improve electronic reporting of public health data to state and local public health agencies.The RFI, which was part of CMS’sannual Inpatient Prospective Payment System proposed rule, asked stakeholders about potential methods, including changing the attestation measure for capability to report public health data electronically to a numerator/denominator quality measure.HIMSS indicated measuring success in reporting public health data is a goal, but the current lack of capability in many public health agencies to receive the data electronically would require a wide range of exemptions, limiting the value of a measure while placing additional burden on health systems.HIMSS continues to endorse significant IT infrastructure funding, with corresponding technical support and workforce development by HHS, as recommended inHIMSS 2022 Public Health Information and Technology Infrastructure Funding Report.In the response, HIMSS also supported proposed changes by CMS for electronic clinical quality measure (eCQM) reporting for both the Promoting Interoperability Program and the Inpatient Quality Reporting Program.The proposed changes included the addition of patient safety focused measures (measuring patient falls and post-surgical respiratory failure) to the self-selected menu for quality reporting starting in 2026, and increasing the number of eCQMs required for reporting, going from six to nine in 2026 and nine to eleven in 2027.HIMSS’s assessment of the new measures determined that the timeline to successfully implement the mechanisms for capturing and reporting the needed data to meet the measures was appropriate, and each of the new measures are meaningful and actionable, meaning improving measure performance should positively impact patient outcomes.HIMSS Public Policy and AdvocacyThe HIMSS policy team works closely with the U.S. Congress, federal decision makers, state legislatures and governments, and other organizations to recommend policy, and legislative and regulatory solutions to improve health through information and technology.Help Advance Health IT Policy"
    },
    {
        "date": "2024-06-11",
        "url": "https://www.himss.org/news/healthcare-students-practice-advocacy-himss-government-relations-team-during-dc-trip-hosted",
        "title": "Healthcare Students Practice Advocacy with HIMSS Government Relations Team During D.C. Trip Hosted by Arizona Chapter",
        "content": "The HIMSS Arizona Chapter recently hosted a cohort of students studying healthcare at Bryan University on a trip to Washington, D.C., for an inside look at policy and advocacy.The students visited the HIMSS office in Virginia to learn about some of the current public policy priorities being led by the HIMSS Government Relations team. Arizona Chapter Advocate Marjorie Rosenorganized the tripas part of the HIMSS Chapter Advocacy Program, which leverages HIMSS’s reach and resources to influence public policy to advance healthcare and population health for all.Marci Little, a health administration student at Bryan University, class of 2025, wrote the following summary of her experience.The healthcare students from Bryan University were given the opportunity to be in Washington, D.C., for a week from April 12-18. We were invited to participate in the school’s Paralegal Program trip. We got the chance to see memorials, monuments, The Supreme Court, Capitol Hill and so many other sites.For me, I was so glad to be able to see the monuments and memorials, but what I wasn’t prepared for was the amazing experience of advocating through HIMSS. This was the best most memorable part of the week for me!For three nights of the trip, we were given the basics of what advocacy is, how it works and what to expect by Marjorie Rosen, Program Director of Healthcare. Everyone had the opportunity to ask questions regarding advocacy and how it works. I knew about advocacy as I had to do a PPE in advocacy to get my associate’s degree. I started to see myself advocating after that assignment.My love of advocacy was fueled during this trip! We attended a meeting with HIMSS in D.C. They showed us everything they possibly could about advocacy. It was beyond amazing! I fell in love with advocacy. We met some amazing people and even got to take a few photos with them. Questions were asked and answered while each of us took notes, mentally or written. We had the chance to see Marjorie teach alongside the HIMSS group regarding what the MATCH IT Act is and how we could help.For our advocacy day on Capitol Hill, we were split into groups. Our job was to meet with our representatives and get them on board with the MATCH IT Act. I had the pleasure of being the speaker of our group at each of our meetings. I am not a great speaker, but I found my voice in advocating. If I took anything from this trip, it is that advocacy is needed to change things, whether it’s in healthcare, government or in your own life.I am so grateful for the opportunity we had to be a part of this during that week. If given the opportunity again, I would gladly take it!HIMSS Public Policy and AdvocacyThe HIMSS policy team works closely with the U.S. Congress, federal decision makers, state legislatures and governments, and other organizations to recommend policy, and legislative and regulatory solutions to improve health through information and technology.Help Advance Health IT Policy"
    },
    {
        "date": "2024-06-06",
        "url": "https://www.himss.org/news/himss-signs-letter-supporting-oncs-mission-promote-adoption-health-it",
        "title": "HIMSS Signs Letter Supporting ONC’s Mission to Promote the Adoption of Health IT",
        "content": "President Biden’s Fiscal Year 2025 (FY2025) proposedbudgetfor the U.S. Health and Hyman Services (HHS) included $86 million for the Office of the National Coordinator for Health Information Technology (ONC), an increase of $17 million above the FY2024 enacted level.As Congress begins to draft their annual spending bills, HIMSS led a multi-stakeholder initiative urging the leaders of the Labor, HHS, and Related Agencies (Labor-HHS) Appropriations subcommittees to fully fund ONC at the president’s proposed FY25 budget request. This increase in funding would help advance interoperability and nationwide, standards-based health information exchange to support better health enabled by data.Read the full letter to congressional appropriations.HIMSS, along with AHIMA and CHIME, led the joint effort that garnered over 50 signers. The letter explained that this necessary funding boost would provide the agency with the resources they have long needed to better serve as the key partner to both public and private sector stakeholders to advance the health information and technology ecosystem. Without this much-needed increase, the organizations worry that they will be hard-pressed to successfully execute the many agency initiatives, and priorities of Congress and the Administration.ONC supports a wide array of initiatives aimed at advancing national goals for better, safer, and more equitable healthcare through a nationwide interoperable health IT infrastructure. These include ensuring technology solutions incorporate baseline cybersecurity and privacy requirements, a health equity by design philosophy for federal health IT programs, continued advancements in patient access to health information and meaningful engagement in their care, and working to advance U.S. public health data infrastructure modernization.To further engage in on this issue, please contactpolicy@himss.org.HIMSS Public Policy and AdvocacyThe HIMSS policy team works closely with the U.S. Congress, federal decision makers, state legislatures and governments, and other organizations to recommend policy, and legislative and regulatory solutions to improve health through information and technology.Help Advance Health IT Policy"
    },
    {
        "date": "2024-06-05",
        "url": "https://www.himss.org/news/himss24-europe-rome-makes-global-headlines",
        "title": "HIMSS24 Europe in Rome Makes Global Headlines",
        "content": "The 2024 HIMSS European Health Conference and Exhibition was a landmark event for the European digital health community, bringing togetherapproximately 2,500healthcare executives, practitioners and professionals from 84 different countries at the iconic Centro Congressi La Nuvola in Rome.The conference, held from May 29-31, showcased the latest advancements in healthcare technology and provided a platform for critical discussions on the future of digital health in Europe and worldwide.One of the key highlights was the emphasis of digital health solutions and new health policies within Europe. The conference featured sessions and workshops that explored topics such as artificial intelligence in healthcare, telemedicine, and the integration of electronic health records.Journalists from around the world took notice of the conference’s major trends and topics, with dozens of in-depth stories being published in Italy, across Europe, and in both the Americas and Asia-Pacific. Highlights of the media coverage from HIMSSEU24 are shared below.One of Italy’s largest newspapers, La Repubblica,reported on the growing importance of digital health technologyin modern healthcare systems.RAI Newsprovided video coverage of the conference’s esteemed guests, Italy’s Minister of Health of the Government Orazio Schillaci and the incumbent Mayor of Rome Roberto Gualtieri.TheIl Quotidiano del Lazioarticle noted Italy’s initiatives to adopt HIMSS digital maturity models, specificallyEMRAMandINFRAM.HIMSS24 Europe addressed the region’s strategic initiatives in digital health, including the AI Act and the European Health Data Space, which aim to position Europe as a leader in digital health.Tagesspiegel,one of Germany’s largest daily newspapers, interviewed HIMSS CEO and President Hal Wolf, who highlighted these initiatives, underscoring their potential to drive significant advancements in healthcare technology and policy. Tagesspiegel also published stories oncombattingworkforce shortagesas well as theNordic Health 2030 campaign.The global reach of the conference was further highlighted in articles from leading Korean media outletsETNewsandKorea Biomedical Review.The top Irish tech publication, Silicon Republic,featured winners of theHIMSS StartupPitchfest, and one of Europe’s top healthcare podcasts,Faces of DigitalHealth,published an episode on the highlights of the conference.The HIMSS24 Europe set the stage for future advancements in digital health in the region and will again as the2025 HIMSS European Health Conference & Exhibitionwill take place in Paris, France, from 10-12 June 2025, at the world-famous venue, Palais de Congrès.As the conference came to a close, HIMSS President and CEOHal Wolfspoke with Healthcare ITNews, about next year’s HIMSS25 Europe in Paris and what to expect.The HIMSS European Health Conference and Exhibition is the destination to learn, connect, innovateBetter patient outcomes and stronger workforces are a team project. At the HIMSS European Health Conference and Exhibition, we’ve built a programme to arm you and your peers with the insights you need to transform health systems back at home.Learn more"
    },
    {
        "date": "2024-06-03",
        "url": "https://www.himss.org/news/himss24-europe-draws-together-thousands-healthcare-leaders-build-tomorrows-health",
        "title": "HIMSS24 Europe Draws Together Thousands of Healthcare Leaders to Build Tomorrow’s Health",
        "content": "Global and European leaders forged new pathways and partnerships to improve healthcare at the 2024 HIMSS European Health Conference and Exhibition, which convened more than 2,000 healthcare executives, practitioners and professionals from 84 countries in Rome to learn, connect and innovate.Esteemed participants included Italy’s Minister of Health of the Government Orazio Schillaci and the incumbent Mayor of Rome Roberto Gualtieri. Disability rights advocate and former NBC Euronews anchor Isabelle Kumar served as moderator for the conference’s most compelling sessions.In addition to hundreds of exhibitors and sponsors showcasing their latest innovations, speakers led in-depth discussions on AI in healthcare, interoperability, health equity, clinical decision supports, wearables, EMR adoption and predictive analytics. Sessions also offered cutting-edge insight into Europe’s current regulatory landscape, including the AI Act, the European Health Data Space, The European Health Union and the European Recovery and Resilience Fund.Keynote addresses were delivered by experts on the forefront of health, innovation and policy, including:Dr David Novillo-Ortiz, Unit Head, Data and Digital Health, WHO Regional Office for EuropeHela Ghariani, Co-Chair of the EU eHealth Network, Co-Head of the Digital Health Delegation, French Ministry of Labor, Health and Solidarity, FranceHenning Schneider, Chief Information Officer, Asklepios Kliniken, GermanyJohn Riggi, Former FBI Senior Executive and Supervisory Special Agent, National Advisor for Cybersecurity and Risk, American Hospital Association, United States of AmericaMarco Marsella, Director, Digital, EU4Health and Health Systems Modernisation, DG SANTE, European CommissionDr Waheed Arian, Humanitarian, innovator, former Afghan refugee, Arian Wellbeing LimitedHal Wolf, President & CEO of HIMSSProf Ernst Kuipers, Board of Directors Member, HIMSS & Former Minister of Health, Welfare and Sport, The Netherlands, Vice President, Research, Nanyang Technological University, SingaporeHIMSS recognized multiple healthcare systems during the Digital Maturity Awards Ceremony at HIMSS24 Europe for their outstanding achievements in enhancing clinical outcomes with the implementation of HIMSS maturity models. Five organizations achieved Stage 7 validations on EMRAM and 15 organizations achieved EMRAM Stage 6.Attendees received an inside look at Italy’s recently launched Fascicolo Sanitario Elettronico, a groundbreaking approach to health data that lets citizens trace their entire medical history online. Innovation funds like Smart&Start Italia are also helping cities across Italy build thriving healthcare startup scenes.Partners from the HIMSS Italian Community — including AISIS, AIIC, Donne 4.0 and Donne Protagoniste en Sanità — also hosted sessions throughout the week.Seven projects showcased advancements in cybersecurity, chronic condition management and patient-focused tools, aiming to improve healthcare outcomes: AI4HealthSec, WARIFA, FLUTE, EDiHTA, Gravitate-Health, Label2Enable, and ADLIFE.HIMSS Strategic Partner GVM Care & Research, led by its CIO Elena Sini, who is also the Chair of the HIMSS Board of Directors, opened the doors of its San Carlo Hospital, a hospital that has experienced heavy investment in technological innovation to improve its healthcare services.The highly anticipated Digital Nursing Summit at the conference was a two-part program that delved into the cutting-edge advancements in digital support for nursing care. In light of the ongoing, global workforce crisis, the second part of the summit focused on strategies to bolster and support nurses in their vital roles.Members of the HIMSS European Nursing Informatics Community and the Italian Nurses Association were in attendance, in addition to speakers such as Professor Pam Cipriano, president of the International Council of Nurses; Christine Antorini, nursing student and former Minister of Education in Denmark; and Matthew Little, associate chief nurse - Digital / chief nurse information officer (CNIO) at Gloucestershire Hospitals NHS Foundation Trust.HIMSS24 Europe showcased emerging healthcare solutions through Startup Pitchfest, offering a platform for innovative startups to address entrenched challenges faced by health systems and providers. Attendees witnessed insightful discussions on leveraging technology to promote health equity, refugee care and mitigate the impact of climate change.As announced in Rome during the closing keynote sessions, the2025 HIMSS European Health Conference & Exhibitionwill take place in Paris, France, from 10-12 June 2025, at the world-famous venue, Palais de Congrès.Join Us as We Reimagine Health Through Information and TechnologyAt HIMSS, our vision is to realize the full health potential of every human, everywhere. Be part of the community that’s transforming the global health ecosystem with courage, curiosity and determination.Be part of what’s next for health"
    },
    {
        "date": "2024-05-31",
        "url": "https://www.himss.org/news/himss-selects-paris-2025-host-city-annual-himss-european-healthcare-technology-conference",
        "title": "HIMSS Selects Paris as the 2025 Host City for the Annual HIMSS European Healthcare Technology Conference",
        "content": "The HIMSS European Health Conference & Exhibition, one of Europe’s largest healthcare technology events, will welcome healthcare thought leaders and professionals from around the world to Paris, France, on 10-12 June 2025.At Palais de Congrès in Paris, the HIMSS European conference will again play host to thousands of healthcare providers, government officials, policymakers, IT professionals and European dignitaries. The conference will bring healthcare's brightest minds together to discuss pan-European collaborations and the latest health tech trends and innovations in key areas such as cybersecurity, data privacy and artificial intelligence.\"We are thrilled to hold the HIMSS25 European Health Conference & Exhibition in Paris.France has made an ambitious effort in digital transformation within the framework of the European Health Data Space. France is a perfect setting to support European innovation in applications and capabilities,” said HIMSS President and CEO Hal Wolf from HIMSS24 in Rome. “The HIMSS Team is working closely with government officials and leading members of the French health eco-system to ensure HIMSS25 Europe is one of our most impactful events yet.”The most influential digital health conference on the continent, HIMSS25 Europe will draw thousands of speakers, exhibitors and attendees from more than 80 countries to share ideas and innovations that will shape the future of healthcare in the EU and beyond.Major topics to be discussed include cybersecurity trends for health organizations, the ethical use of AI in healthcare, patient data and privacy issues, workforce burnout, staffing shortages and recent global health policy and regulatory changes.Attendees to HIMSS25 Europe will have access to expert-level speakers and education tracks, an exhibition hall with hundreds of exhibitors showcasing the latest innovations in healthcare technology and networking opportunities with fellow healthcare leaders from around the world.HIMSS25 Europe follows a highly successful 2024 European conference that took place in Rome and featured top voices from both the private and public sectors, including European CommissionMinisters of Health, EU regulators and representatives from the World Health Organization.A formal call for proposals and general registration information for HIMSS25 Europe will be announced later this year.The HIMSS European Health Conference and Exhibition is the destination to learn, connect, innovateBetter patient outcomes and stronger workforces are a team project. At the HIMSS European Health Conference and Exhibition, we’ve built a programme to arm you and your peers with the insights you need to transform health systems back at home.Learn more"
    },
    {
        "date": "2024-05-30",
        "url": "https://www.himss.org/news/himss24-europe-digital-maturity-awards-ceremony-recognizes-exceptional-healthcare-systems",
        "title": "HIMSS24 Europe Digital Maturity Awards Ceremony Recognizes Exceptional Healthcare Systems",
        "content": "HIMSS recognized multiple healthcare systems for their outstanding achievements in enhancing clinical outcomes with the implementation of HIMSS maturity models during the Digital Maturity Awards Ceremony, which took place on30 May at the HIMSS24 European Health Conference & Exhibition.TheHIMSS suite of digital health maturity modelsprovide prescriptive frameworks for healthcare organizations to assess their current digital maturity status, then propose an investment and vendor-neutral roadmap toward a digital deployment success. HIMSS offers six maturity models and one Digital Health Indicator in the suite of digital health tools and provides the world’s healthcare systems with expert guidance and strategies to improve patient outcomes, protect data, reduce costs, and better support their staff.The Digital Maturity Awards Ceremony featured validations for the HIMSSEMRAM,AMAM,C-COMMandINFRAMmaturity models.Congratulations to the following 3 organizations for achieving Stage 7 – the highest level – of EMRAM:Liverpool Heart and Chest NHS Foundation Trust – United KingdomIstanbul Bahçelievler Devlet Hastanesi - TurkeyIstanbul Kosuyolu Yuksek Ihtisas Egitim ve Arastirma Hastanesi- TurkeyCongratulations to the following 13 organizations for achieving Stage 6 of EMRAM:Cleveland Clinic London - United KingdomFondazione Poliambulanza Istituto Ospedaliero - ItalyNew Clinic Public Legal Entity - AzerbaijanAntalya Akseki Ilçe Devlet Hastanesi - TurkeyAntalya Kemer Devlet Hastanesi- TurkeyAntalya Kumluca Devlet Hastanesi- TurkeyAydin Kuşadası Devlet Hastanesi- TurkeyErzurum Hinis Sehit Yavuz Yürekseven Devlet Hastanesi- TurkeyEskisehir Sehir Hastanesi- TurkeyBolu İzzet Baysal Ağız ve Diş Sağlığı Merkezi- TurkeyBursa Şehir Hastanesi- TurkeyIstanbul Basaksehir Çam ve Sakura Sehir Hastanesi- TurkeyIstanbul Beykoz Devlet Hastanesi- TurkeyEMRAM utilizes methodology and algorithms to assess the digital maturity of entire hospitals worldwide. It offers a comprehensive roadmap to facilitate adoption and embark on a digital transformation journey toward ambitious goals.Congratulations to the following 2 organizations for achieving Stage 7 – the highest level – of O-EMRAM:Sakarya Agiz ve Dis Sagligi Hastanesi - TurkeyDüzce Agiz ve Dis Sagligi Merkezi - TurkeyCongratulations to the following organization for achieving Stage 6 of C-COMM:King Abdulaziz Medical City - Saudi ArabiaCongratulations to the following organization for achieving Stage 6 of INFRAM:Barts Health NHS Hospital - United KingdomThe HIMSS suite of healthcare maturity models offers structured frameworks to healthcare organizations for establishing their digital health ecosystems. Each of the eight-stage (0-7) maturity models serves as a vendor-neutral guide for success and provides global benchmarking opportunities.HIMSS congratulates all recipients for their outstanding efforts and dedication to improving digital health in their communities.Digital Health TransformationHIMSS has built evidence-based models and frameworks for the sole purpose of advancing health system capability. Whether your organization is looking to improve clinical outcomes, financial viability or operational efficiencies, this is your toolkit to drive healthcare forward.Learn More"
    },
    {
        "date": "2024-05-30",
        "url": "https://www.himss.org/news/member-spotlight-reza-ryan-sadeghian-md-mba-msc-cpe-cphimss-chcio-cdh-e-chisl-faap-fhimss",
        "title": "Member Spotlight: Reza Ryan Sadeghian, MD, MBA, MSc, CPE, CPHIMSS, CHCIO, CDH-E, CHISL, FAAP, FHIMSS; Principal Healthcare Strategist at MITConn Consulting, Second-Year HIMSS Physician Committee Member",
        "content": "Dr. Sadeghian has contributed to pieces on AI, digital health platforms, and user experience in his year and a half on the HIMSS Physician Committee. He has also recently published three books on AI, clinician engagement, and leadership. He is committed to leveraging innovative technology and digital transformation to shape the future of healthcare.Read more on Dr. Sadeghian’s thoughts on the healthcare industry.How have industry connections and relationships helped you achieve your biggest professional milestones?My career in healthcare and informatics has been greatly enriched by a robust network of industry connections. These relationships have been pivotal in providing me with unique insights and opportunities, allowing me to stay at the forefront of technological advancements and healthcare trends. By actively engaging with leaders and innovators across various disciplines, I've been able to foster a collaborative environment that champions innovation and drives significant improvements in healthcare delivery. This network has not only supported my professional growth but also empowered me to contribute meaningfully to the evolution of healthcare, ensuring that we continue to enhance patient care and system efficiencies on a broad scale.What are the benefits of a health information and technology career? Why should someone consider it?A career in health information and technology offers several compelling benefits, making it an attractive option for many professionals. Here are some reasons why someone might consider pursuing this path:Impact on Patient Care: Professionals in health information and technology play a crucial role in improving patient outcomes. By developing and implementing technologies like electronic health records (EHRs), telemedicine platforms, and digital health applications, they help ensure that patient care is more accurate, efficient, and accessible.Growing Demand: As healthcare increasingly relies on digital systems, the demand for skilled professionals in health IT continues to rise. This growth is driven by the need for data management, system development, and continuous improvement in healthcare technologies, ensuring stable career opportunities.Innovation and Technology Integration: This field is at the forefront of integrating cutting-edge technologies, such as artificial intelligence, machine learning, and blockchain into healthcare. These innovations have the potential to transform healthcare delivery, making it a dynamic and exciting career path.Interdisciplinary Opportunities: Health IT professionals work at the intersection of medicine, technology, and business, providing opportunities to engage with various aspects of healthcare. This interdisciplinary nature allows for diverse career paths and the ability to work in multiple settings, including hospitals, tech companies, government agencies, and research institutions.Improving Healthcare Accessibility and Efficiency: Through the development and optimization of healthcare technologies, professionals in this field contribute to making healthcare more accessible, particularly in underserved or remote areas. Additionally, they work on enhancing the efficiency of healthcare delivery, which can lead to reduced costs and better health outcomes.Professional Satisfaction and Security: The field offers significant professional satisfaction by contributing to advancements that directly benefit public health and individual patient care. Additionally, the ongoing evolution in the sector often leads to job security, as skilled professionals are continually needed to manage, innovate, and improve healthcare technologies.Lucrative Career Options: Health IT often offers competitive salaries and benefits due to the specialized knowledge and skills required. As healthcare organizations prioritize technology integration and digital transformation, the value placed on these roles continues to grow.What do you see as the future of health information and technology? Where do you think the industry can/will go?The future of health information and technology is poised to be transformative, driven by rapid advancements in technology and an increasing focus on personalized healthcare. Here are several key directions and trends that the industry is likely to pursue:Artificial Intelligence and Machine Learning: These technologies will continue to expand within healthcare, enhancing everything from diagnostic tools to treatment protocol development, and even patient management systems. AI could help in predicting disease outbreaks, personalizing treatment plans based on genetic information, and automating administrative tasks to reduce the burden on healthcare providers.Telemedicine and Remote Care: The COVID-19 pandemic has already accelerated the adoption of telemedicine, and this trend is expected to continue. Future developments will likely focus on enhancing the capabilities of telehealth services, including better integration with EHRs, improved remote monitoring technologies, and more robust platforms for patient-doctor interaction.Wearable Health Technology: Wearables are becoming more sophisticated, collecting a wide array of health metrics from heart rate to blood sugar levels. Future advancements may allow these devices to predict health issues before they become serious, prompting timely medical interventions.Blockchain for Health Data Security: As health data becomes increasingly digitized, ensuring its security and privacy is paramount. Blockchain technology offers a promising solution to secure health data exchanges across platforms and stakeholders, ensuring transparency and reducing fraud.Interoperability and Data Integration: Efforts will continue to improve interoperability among different health information systems. This will facilitate smoother exchanges of data across healthcare providers, payers, and patients, improving care coordination and efficiency.Expanded Use of Electronic Health Records (EHRs): EHRs will evolve beyond mere documentation tools to become comprehensive platforms that integrate various data types (clinical, genomic, and social determinants of health) to provide holistic views of patient health.Precision Medicine: Leveraging big data, analytics, and genetic information, precision medicine will likely see accelerated growth. This approach tailors medical treatments to individual characteristics, leading to more effective and targeted therapies.Regulatory and Ethical Developments: As technology advances, regulatory frameworks will need to evolve to address new challenges related to data privacy, ethical use of AI, and patient consent. This will be crucial in maintaining trust and ensuring that innovations enhance patient care without compromising ethical standards.Healthcare Consumerism: Patients are increasingly becoming active participants in their healthcare journeys. Technology will empower them with more tools and platforms to make informed decisions about their health, from choosing providers to engaging in preventative care.Global Health Initiatives: Technology will play a key role in global health, particularly in managing health crises, improving health equity, and expanding access to care in low-resource settings.The industry's trajectory suggests a future where technology not only supports but actively enhances healthcare delivery, making it more personalized, efficient, and accessible. These advancements hold the potential to dramatically improve health outcomes and transform the experience of both patients and providers.Join Us as We Reimagine Health Through Information and TechnologyAt HIMSS, our vision is to realize the full health potential of every human, everywhere. Be part of the community that’s transforming the global health ecosystem with courage, curiosity, and determination.Be part of what’s next for health"
    },
    {
        "date": "2024-05-29",
        "url": "https://www.himss.org/news/member-spotlight-danny-lee-md-facp-chief-medical-information-officer-johns-hopkins-community",
        "title": "Member Spotlight: Danny Lee, MD, FACP Chief Medical Information Officer at Johns Hopkins Community Physicians, Second-Year HIMSS Physician Committee Member",
        "content": "Dr. Lee has contributed to pieces on physician burden reduction, interprofessional collaboration, and AI while serving on the HIMSS Physician Committee. In 2015, he was awarded the Johns Hopkins Innovation in Clinical Care. Since then, he has continued to focus on patient safety and provider efficiency. In 2020 and 2021, he helped lead his teams to win back-to-back Surescripts White Coat Safety Awards for our work in safe e-prescribing practices at Johns Hopkins.Read more about Dr. Lee’s thoughts on the healthcare industry.How have industry connections and relationships helped you achieve your biggest professional milestones?Collaborating with experts (other clinical informaticists, Epic physician builders, and quality officers) helps me foster knowledge of quality metrics and develop tools that enhance patient care and provider success. Joining HIMSS has fostered a robust network within the healthcare IT industry, exposing me to a wider range of approaches to shared challenges. This network has facilitated collaboration and knowledge exchange, leading to more effective solutions.What are the benefits of a health information and technology career? Why should someone consider it?Collaborating with diverse teams across departments fosters a holistic understanding of managing complex healthcare organizations and hones the ability to navigate diverse perspectives to achieve shared goals. The health information and technology field offers benefits and exciting prospects. Here's why:Crucial Industry Connections: Collaborating with experts (other clinical informaticists, Epic physician builders, and quality officers) helps me foster knowledge of quality metrics and develop tools that enhance patient care and provider success.Interdisciplinary Value: Working alongside diverse teams from various departments deepens understanding of managing large healthcare organizations and cultivates the ability to navigate differences to achieve shared goals.The Future is Bright (and AI-Powered): Artificial Intelligence (AI) is rapidly transforming healthcare workflows. While cost and evaluating new AI technologies pose current challenges, the potential for AI integration into every aspect of healthcare – from patient care to finance and equity – is vast.Building solid relationships within the industry is essential for professional growth in health information and technology. This dynamic field holds great promise for the future.What do you see as the future of health information and technology? Where do you think the industry can/will go?Artificial Intelligence (AI) is rapidly transforming healthcare workflows. While cost and evaluating new AI technologies pose current challenges, the potential for AI integration into every aspect of healthcare – from patient care to finance and equity – is vast.Join Us as We Reimagine Health Through Information and TechnologyAt HIMSS, our vision is to realize the full health potential of every human, everywhere. Be part of the community that’s transforming the global health ecosystem with courage, curiosity and determination.Be part of what’s next for health"
    },
    {
        "date": "2024-05-24",
        "url": "https://www.himss.org/news/office-civil-rights-announces-final-rule-protect-reproductive-healthcare-data-privacy",
        "title": "Office for Civil Rights Announces Final Rule to Protect Reproductive Healthcare Data Privacy",
        "content": "On April 22, 2024, the U.S. Department of Health and Human Services Office for Civil Rights (OCR) finalized its rule,HIPAA Privacy Rule to Support Reproductive Health Care Privacy.The rule aims to improve patient data protections around lawful reproductive health care services, thereby encouraging patients to seek these services when necessary and improve patient trust in the healthcare system.HIMSS strongly supports the overall goals of this rule, which specifically “prohibits uses and disclosures of protected health information (PHI) for criminal, civil, or administrative investigations or proceedings against individuals” for seeking, obtaining, providing or facilitating reproductive healthcare that is lawful under the circumstances in which it was provided.HIMSS applauds OCR’s decisions to properly educate covered entities about this rule, to provide a model attestation in advance of the rule’s compliance date of December 23, 2024, and to educate patients through, for example, requiring the patient’s Notice of Privacy Protections form to be made available in multiple languages. HIMSS continues to encourage OCR to explore health IT solutions for delivering the Notice of Privacy Protections and other privacy education resources to patients in culturally inclusive ways.HIMSS anticipates that several provisions of the final rule may present challenges for ubiquitous information exchange in a manner that also provides the appropriate protections for patients. In apublic commentletter responding to the proposed rule from June 16, 2023, HIMSS called on OCR to expand these protections to patients receiving all forms of healthcare. HIMSS believes that healthcare information should not be used unfairly against patients and determining who has access and reasons for access should be the same for all healthcare interventions, not only for reproductive health care services. OCR did not adopt HIMSS’s recommendation, however HIMSS will continue to advocate for these protections for patients in future public comment opportunities.HIMSS also raised concerns about the challenges to parse out reproductive health data and protect those data in a different manner than other healthcare data, as required in the Final Rule. Healthcare organizations report significant operational challenges segregating certain types of personal health information (PHI) from other PHI. OCR acknowledges this challenge, however, asserts that this is critical to improve patient protections for reproductive health, as this specific type of data may unfairly target patients in the current US political landscape. OCR broadly defined reproductive health services, with a non-exhaustive list of examples of services, which aims to make this process easier. OCR also asserts that this rule should not increase data segmentation concerns beyond those that already exist. HIMSS recommends continued work at ONC to improve data sharing and segmentation standards to reduce unnecessary administrative burden and costs on health systems.Overall, HIMSS is highly pleased with OCR’s final rule and recognizes the importance of protecting reproductive health data, which would improve patient trust and willingness to receive lawful reproductive health care services. HIMSS regularly analyzes and seeks comments on federal regulations. HIMSS members interested in contributing to comment letters, please reach out topolicy@himss.org.Visit HIMSS’sPublic Policy Centerfor more information.HIMSS Public Policy and AdvocacyThe HIMSS policy team works closely with the U.S. Congress, federal decision makers, state legislatures and governments, and other organizations to recommend policy, and legislative and regulatory solutions to improve health through information and technology.Help Advance Health IT Policy"
    },
    {
        "date": "2024-05-24",
        "url": "https://www.himss.org/news/nurses-month-member-spotlight-jesus-diaz-mba-msn-rn",
        "title": "Nurses Month Member Spotlight: Jesus A. Diaz MBA, MSN, RN",
        "content": "May is National Nurses Month, a time to honor and celebrate the incredible work of nurses. HIMSS is celebrating its members who are on the front lines every day.What is the organization of your employment?Memorial Healthcare SystemWhat is your current position?Director, Nursing informaticsTell us more about your background.I've been a Registered Nurse since 2009 and have primarily served Behavioral Health populations across various settings until transitioning into Informatics in 2017. Obtaining a quality education was always a personal and professional goal of mine. In 2009, I achieved my ADN and in 2013 I completed an RN-MSN program at Nova Southeastern University and earned my MSN with Highest Honors. In 2018, I went back to Florida International University and earned my Healthcare MBA with Highest Honors. Although I may have taken an unconventional path into Informatics, I always found value in the role technology played in the delivery of care and the impact it had in gaining overall efficiencies. Having this insight allowed me to carry my successes from bedside care and operational roles into Informatics while continuously learning.Along the way, I've had the opportunity to volunteer in various South Florida and National organizations dedicated to the Health Information Technology Community. As a Nurse Informatics Leader, I take pride in partnering with our clinical stakeholders to support healthcare operations at the patient's bedside through analytics, collaborative leadership and technology adoption.How do you engage with the broader nursing informatics community?Engaging with various Nursing Informatics forums allows you to network with like-minded professionals while staying up to date with emerging technologies and trends within Health Information Technology.How can the nursing informatics community support a new informatics leader?Offering mentorships to the aspiring Nurse Informaticist or Nurse leader is the best way to support someone's growth and development. This offers someone opportunities to explore real-world exposure to the evolving role of Informatics while offering a glimpse to a seat at the decision-making table. This is increasingly becoming more prominent as technology is at the crossroad of most business decisions happening in healthcare today.What advice can you share to a new informatics nurse or leader?Network and develop meaningful relationships as they mean everything, and you can never stop learning! Join professional groups and attend networking events to grow your professional brand. Lastly, take your career to the next level and become certified in your area of expertise.How can nurses become involved in nursing informatics?If you are new to Informatics, join a professional organization that provides industry leading educational content. You can also inquire with your employer if they have a mentorship program or Nursing Informatics workgroup that you can collaborate with and learn from. This will be an invaluable part of your growth journey.Can you share how the nursing informatics community has helped you overcome a challenge or inspired your work?The HIMSS Nursing Informatics community has allowed me to learn from thought leaders across the country. Access to this expansive group ensures that you are receiving industry leading content which allows you to learn from. The days of reinventing the wheel are over when you have such a collective group of thought leaders who you can access and tap into. Personally, learning about advances in Virtual Nursing and Consumer Experience has allowed me to both excel in my role and better serve the patient populations I serve.Nurses Month is sponsored by BD.Join Us as We Reimagine Health Through Information and TechnologyAt HIMSS, our vision is to realize the full health potential of every human, everywhere. Be part of the community that’s transforming the global health ecosystem with courage, curiosity and determination.Be part of what’s next for health"
    },
    {
        "date": "2024-05-23",
        "url": "https://www.himss.org/news/nominate-innovative-health-leaders-2025-himss-changemaker-health-awards",
        "title": "Nominate Innovative Health Leaders for 2025 HIMSS Changemaker in Health Awards",
        "content": "HIMSS members are invited tosubmit nominations for the 2025 HIMSS Changemaker in Health Awards, which recognize inspirational and innovative health leaders who rigorously challenge the status quo on their journey to build a brighter health future.HIMSS Changemakers positively exemplify the HIMSS mission and vision, drive transformational change, take bold action to propel innovation, represent the highest standards of leadership and advocate for end-users and patients.Award recipients will be selected through votes cast by HIMSS members, making the HIMSS Changemaker in Health Awards a true representation of the HIMSS voice of the health information and technology community.Nominators, nominees and voters must be HIMSS members to participate.Become a HIMSS member todayto join the global health transformation. The Changemaker Awards nomination period will remain open through July 1, 2024.Changemaker InterviewsHear inspirational interviews with the 2024 HIMSS Changemaker in Health Award Recipients.Learn more2025 Changemaker Award Recipient Categories:CXO; Senior ExecutiveGlobal Patient InnovatorHealth EquityHIMSS Chapter Advocate (Volunteer)HIMSS Chapter Leader (Volunteer)HIMSS John A. Page Distinguished FellowPolicy InfluencerWomen in Health ITPartner Award Finalist Categories:HIMSS-AMDIS Physician Executive LeaderHIMSS-ANI Nursing Informatics LeadershipHIMSS-ACCE Excellence in Clinical Engineering and Information Technology SynergiesLearn more about the2025 HIMSS Changemaker in Health Awards, eligibility,criteriaand application requirements. Please direct questions toawards@himss.org.Join Us as We Reimagine Health Through Information and TechnologyAt HIMSS, our vision is to realize the full health potential of every human, everywhere. Be part of the community that’s transforming the global health ecosystem with courage, curiosity and determination.Be part of what’s next for health"
    }
]