[
    {
        "news_url": "https://www.himss.org/news/himss24-apac-designed-enhance-knowledge-and-foster-innovation",
        "news_title": "HIMSS24 APAC Designed to Enhance Knowledge and Foster Innovation",
        "news_date": "2024-07-10:00",
        "news_content": "With focused learning tracks on artificial intelligence, smart hospitals, cybersecurity and innovations, t he 2024 HIMSS APAC Health Conference & Exhibition is bringing together a global community of inspired thought leaders to drive advancement of digital health throughout Asia-Pacific and beyond. Registration is open for HIMSS24 APAC , taking place 1-4 Oct. 2024 in Seoul, South Korea. The conference features pre-conference events, two days of extensive main conference programming and focused post-conference sessions. Visionary keynotes, interactive demonstrations and a digital health technology exhibition will illuminate cutting-edge health tech topics, enhance knowledge and foster innovation. Sessions catered to HIMSS24 APAC’s four learning tracks on artificial intelligence, smart hospital, cybersecurity and innovations will include fireside chats, real-world case studies, demonstrations and more. Attendees will harness technology to improve patient outcomes, achieve operational efficiencies and reduce costs. Sessions will explore practical applications of technology in healthcare including deploying generative AI in a clinical environment , nationwide initiatives in healthcare transformation , EMR experiences in Asia-Pacific , implementing ai powered triage for a national virtual and digital front door and more. A government briefing delivered by HIMSS Senior Vice President & Head of Government Relations Tom Leary will cover key healthcare issues and HIMSS’s work with governments globally. Experience advanced medical systems and management practices shaping the future of global healthcare with exclusive opportunities to tour leading hospitals in Korea . Hospital tours offer first-hand insights into how cutting-edge digital healthcare technologies are applied in real-world settings. HIMSS24 APAC will be co-located and run in concurrence with the K-Hospital Healthtech Fair 2024, hosted by the KHA, at the COEX Convention & Exhibition Center in the Gangnam district. 2024 HIMSS APAC Health Conference & Exhibition Together, our community is creating tomorrow's health, and HIMSS24 APAC is going to be the best conference yet. Witness the best of Korean healthcare as it converges with the international offering HIMSS brings to the event. Register Now",
        "news_summary": "The 2024 HIMSS APAC Health Conference & Exhibition will be held from October 1-4, 2024, in Seoul, South Korea. The event will feature learning tracks on artificial intelligence, smart hospitals, cybersecurity, and innovations, with pre-conference events, main conference programming, and post-conference sessions. Attendees will explore practical applications of technology in healthcare, including generative AI, healthcare transformation, and AI-powered triage. The conference will also include a government briefing and hospital tours showcasing advanced digital healthcare technologies. The event will run concurrently with the K-Hospital Healthtech Fair 2024.",
        "sentiment": "positive",
        "keywords_list": [
            "Artificial intelligence",
            "AI",
            "cybersecurity",
            "Innovation",
            "Improving patient outcomes",
            "healthcare transformation",
            "Hospital"
        ],
        "source_name": "HIMSS"
    },
    {
        "news_url": "https://www.himss.org/news/himss-celebrates-recipients-univants-healthcare-excellence-awards",
        "news_title": "HIMSS Celebrates Recipients of Univants of Healthcare Excellence Awards",
        "news_date": "2024-07-08:00",
        "news_content": "As a founding program partner of Abbott's Univants of Healthcare Excellence Awards, HIMSS is pleased to recognize and celebrate the 12 team awardees who are collaborating across disciplines to transform healthcare delivery and the lives of patients. Each of the recognized teams achieved measurably better healthcare with innovative, diverse and inspiring outcomes that spanned multiple disease states, clinical pathways, geographical locals and healthcare disciplines. The 2024 awardees include three top global winners, three teams of distinction and six teams of achievement. Univants of Healthcare Excellence Top Elite Winners GetCheckedOnline: Better access to testing for sexually-transmitted and blood-borne infections British Columbia Centre for Disease Control Devon Haag, Meghan McLennan, Garth Graham, Mark Gilbert, Susie van der Valk Early detection of metabolic-dysfunction associated steatotic liver disease using FIB-4 Premier Integrated Labs Sdn Bhd Yoke Lee Low, Hareeff Muhammed, Leslie Charles Lai Chin Loy, Mun Yee, Evonne Kong Improved management of patients with high LDL-C through electronic health record-directed algorithms for guideline-concordant high-intensity statin prescribing Kaiser Permanente Southern California Matthew Mefford, Michael Kanter, Ronald Scott, Kristi Reynolds, Tracy Imley Univants of Healthcare Excellence Recognition of Distinction Improving equity in maternal and newborn outcomes by eliminating disparities in maternal drug screening Washington University School of Medicine, Barnes-Jewish Hospital, and St. Louis Children’s Hospital Vahid Azimi, Jeannie Kelly, Lauren Nacke, Noor Riaz, Stephen Roper Improving access to health services in vulnerable communities affected by war Esculab Viktoriia Honcharenko, Anna Konyk, Olena Yanchinska, Liudmyla Kostiuk, Iryna Mandzyuk Improved patient outcomes facilitated by C-peptide testing, enabling reclassification and therapeutic changes for patients with diabetes University Hospital of Wales Arshiya Tabasum, Colin Dayan, Rowan Hellier, Carol Evans, Julia Johansson Evans Univants of Healthcare Excellence Recognition of Achievement Reducing unnecessary CT scans in the emergency department with new mild head injury assessment pathway Klinikum Lüneburg Felix Brüning-Wolter, Meike Schrader, Nicola Wolff, Thomas Rodt, Jörg Cramer The Kansas Two-Step: Simplifying the diagnosis of clostridioides difficile at an academic medical center The University of Kansas Health System Matthew Loeb, Matt Humphrey, Sarah Mester, Matt Shoemaker, Maggie Reavis No time to lose with lives on the line - Maximizing efficiency in the lab to save more lives through organ donation Southwest Transplant Alliance Selena Warden, Doug Butler, Sean Forquer, Reid Freeman, Cristina Solomon The Women and Heart Program - Empowering women’s health through early identification and prevention of coronary risk Institute for Cardiovascular Prevention and Rehabilitation Andrea Snagić, Goran Krstačić, Ante Miljak, Sonja Frančula-Zaninović Reducing unnecessary admissions associated with pediatric mononucleosis via implementation of EBV IgM testing in the emergency department Emergency Clinical County Hospital Targu Mures Oana Roxana Oprea, Karoly Vecsei, Florina Floristeanu, Lucia Mezei, Dobreanu Minodora Establishment of a monomer prolactin detection method and specific reference interval to enhance the ability to identify macroprolactinemia Huashan Hospital Fudan University Ming Guan, Yao Hu, Hongying Ye, Zhaoyun Zhang, Yao Zhao Winners were selected by a blinded and comprehensive scoring rubric as judged by healthcare professionals. The application cycle for UNIVANTS of Healthcare Excellence awards in 2025 opens Nov. 15, 2024. HIMSS’s fellow founding program partners for the UNIVANTS of Healthcare Excellence award program include the International Federation of Clinical Chemistry and Laboratory Medicine (IFCC), Association for Diagnostics and Laboratory Medicine (ADLM, formerly AACC), EHMA (European Health Management Association), Modern Healthcare, National Association of Healthcare Quality (NAHQ), and the Institute of Health Economics (IHE); each in partnership with Abbott. Join Us as We Reimagine Health Through Information and Technology At HIMSS, our vision is to realize the full health potential of every human, everywhere. Be part of the community that’s transforming the global health ecosystem with courage, curiosity and determination. Be part of what’s next for health",
        "news_summary": "HIMSS, in collaboration with Abbott's Univants of Healthcare Excellence Awards, celebrates 12 teams for their innovative contributions to healthcare. The awards recognize teams that have achieved significant improvements in healthcare delivery across various disciplines and geographical locations. The 2024 awardees include three top global winners, three teams of distinction, and six teams of achievement. These teams have made strides in areas such as disease detection, patient management, and healthcare equity. The next application cycle opens on Nov. 15, 2024.",
        "sentiment": "positive",
        "keywords_list": [
            "Improving patient outcomes",
            "healthcare policy changes",
            "transforming care"
        ],
        "source_name": "HIMSS"
    },
    {
        "news_url": "https://www.himss.org/news/member-spotlight-dr-william-hayes-md-mba-recently-retired-cmo-trubridge",
        "news_title": "Member Spotlight: Dr. William Hayes, MD, MBA, Recently Retired CMO From Trubridge",
        "news_date": "2024-07-08:00",
        "news_content": "Dr. Hayes is in his second year on the HIMSS Physician Committee and has contributed to impactful deliverables in the areas of data effects on healthcare delivery and contributed to the 6-part series on large language models, which was published in 2023. He has also worked alongside of the EHRA and the Physician Committee on collaboration opportunities. Dr. Hayes always has the physician role top of mind and works to improve the daily workflow of the physicians in the industry. We would like to thank Dr. Hayes for all that he has contributed to in the industry. Below are some of his thoughts on careers in HIT and what he sees as the future of HIT. How have industry connections and relationships helped you achieve your biggest professional milestones? Dr. Hayes : Industry connections and relationships in the Healthcare Information Technology space and Informatics is the key to driving forward any and all innovations and improvements.  It is what fosters the needed collaboration to drive success and needed alignment in fields that are very complex. What are the benefits of a health information and technology career? Why should someone consider it? Dr. Hayes : The ultimate benefit is to contribute what may seem like a small change improvement or innovation that then goes out and helps an extremely large number of patients who each benefit from that change or improvement and innovation.  In other words, there is the opportunity to help innumerable people in the improved delivery of Health Care through Health Care Information Technology as it is a direct delivery tool of Health Care. What do you see as the future of health information and technology? Where do you think the industry can/will go? Dr. Hayes : It will continue to improve in its abilities and applications.  It has to continue to evolve to an improving interoperable system and technologies that truly hold the patient and their profile level data as the center from which to operate and serve the improvement of everyone’s health care. Join Us as We Reimagine Health Through Information and Technology At HIMSS, our vision is to realize the full health potential of every human, everywhere. Be part of the community that’s transforming the global health ecosystem with courage, curiosity, and determination. Be part of what’s next for health",
        "news_summary": "Dr. Hayes, a member of the HIMSS Physician Committee, has significantly contributed to healthcare delivery improvements and large language model research. He emphasizes the importance of industry connections in driving innovation and collaboration in Healthcare Information Technology (HIT). Dr. Hayes highlights the career benefits in HIT, noting the potential to impact many patients positively. He envisions a future where HIT continues to evolve, focusing on interoperable systems centered around patient data. HIMSS invites individuals to join their mission to transform global health through technology.",
        "sentiment": "positive",
        "keywords_list": [
            "data",
            "healthcare",
            "innovation",
            "collaboration",
            "improving patient outcomes",
            "healthcare logistics"
        ],
        "source_name": "HIMSS"
    },
    {
        "news_url": "https://www.himss.org/news/join-healthcare-revolution-himss-ai-healthcare-forum",
        "news_title": "Join the Healthcare Revolution at the HIMSS AI in Healthcare Forum",
        "news_date": "2024-07-02:00",
        "news_content": "Artificial Intelligence is already making a major impact on nearly every aspect of the healthcare industry – from supporting diagnostic and patient care decisions to improving administrative workflows to increasing budgeting and staffing efficiency. However, healthcare practitioners and professionals know that the implementation of AI in healthcare has only just begun. As healthcare organizations continue to invest more in artificial intelligence to revolutionize care, the HIMSS AI in Healthcare Forum offers an unparalleled opportunity to gain insight into the latest industry advancements and explore innovative solutions. Registration is open for the AI forum, slated for Sept. 5-6 in Boston. This event brings together thought leaders and leading experts to provide attendees with an in-depth look into the diverse applications of AI in healthcare. Learn more about the revolutionary programming taking place at The Westin Copley Place in Boston. Quality sessions The forum will showcase a series of significant case studies that highlight the potential of artificial intelligence in healthcare. These enlightening studies include the application of AI in cybersecurity, the groundbreaking AI model for sepsis screening, the utilization of generative AI in clinical workflows and the use of AI to address the supply-demand disparity in healthcare. Additionally, sessions will delve into the critical infrastructure needed to support AI, gather insights from the patient perspective on AI in healthcare, deliberate the merits of employing generative AI, navigate the intricate landscape of ethics, regulation and innovation in pursuit of AI governance and glean valuable lessons from real-world experiences in scaling AI initiatives. Access to industry visionaries Gain valuable insights from distinguished speakers at the forum, including a representative from the U.S. Department of Health and Human Services who will provide a current overview of the AI regulatory environment. Participate in thought-provoking discussions led by esteemed leaders and experts from renowned institutions such as Cleveland Clinic, Mayo Clinic Platform, Stanford Health Care, Johns Hopkins Medicine, Dana-Farber Cancer Institute, Mass General Brigham and the Michigan Department of Health and Human Services, among others. Hands-on experiences Witness the latest in machine learning and AI at the forum’s live technology demos, featuring the innovative companies and organizations that push the boundaries of AI in healthcare. The forum also hosts networking breaks throughout the event, cultivating an environment for insight exchange and connections with like-minded professionals. The AI in Healthcare Forum promises to cut through the hype and offer a comprehensive showcase of real-world examples illustrating the transformative potential of AI across the healthcare continuum. AI in Healthcare Forum Engage with experts at the forefront of innovation as they analyze the intricacies of integrating AI into healthcare settings. You’ll glean actionable insights from successful implementations and lessons learned from challenges encountered along the way. Register Now",
        "news_summary": "The HIMSS AI in Healthcare Forum, scheduled for Sept. 5-6 in Boston, will explore the transformative potential of artificial intelligence in healthcare. The event will feature case studies on AI applications in cybersecurity, sepsis screening, clinical workflows, and addressing supply-demand disparities. Attendees will gain insights from industry leaders and experts from top institutions and participate in live technology demos and networking opportunities. The forum aims to provide a comprehensive understanding of AI's impact on healthcare and offer actionable insights from real-world implementations.",
        "sentiment": "positive",
        "keywords_list": [
            "Artificial intelligence",
            "AI",
            "cybersecurity",
            "sepsis screening",
            "clinical workflows",
            "healthcare",
            "healthcare continuum",
            "machine learning",
            "AI regulatory environment",
            "innovation",
            "patient care",
            "diagnostic",
            "administrative workflows",
            "budgeting",
            "staffing efficiency"
        ],
        "source_name": "HIMSS"
    },
    {
        "news_url": "https://www.himss.org/news/himss24-apac-leading-voices-digital-health-converge-seoul",
        "news_title": "HIMSS24 APAC: Leading Voices in Digital Health Converge in Seoul",
        "news_date": "2024-06-26:00",
        "news_content": "International thought leaders and esteemed healthcare professionals will reunite with the healthcare technology community at the most influential digital health conference in the APAC region this October. The 2024 HIMSS APAC Health Conference & Exhibition will take place 1-4 Oct. 2024 in Seoul, South Korea, assembling the region’s foremost subject matter experts on artificial intelligence, smart hospitals, decentralized care, cybersecurity and the future of healthcare delivery. The upcoming HIMSS24 APAC Conference promises an insightful and robust conference program, highlighting the nation's commitment to healthcare innovation. This event follows the recent memorandum of understanding signed on May 17 between HIMSS, the Korea Hospital Association (KHA), and the Korea Health Information Services (KHIS). This partnership, aimed at driving digital transformation within South Korea's healthcare sector, emphasized the concerted effort to advance healthcare capabilities through digital health initiatives. HIMSS24 APAC will be co-located and run in concurrence with the K-Hospital Healthtech Fair 2024, hosted by the KHA, at the COEX Convention & Exhibition Center in the Gangnam district. Among the expert lineup of speakers are thought leaders who bring a wealth of knowledge, insights and real-world experience from around the world, ensuring a comprehensive view of digital health topics. Featured speakers include: Brian R. Spisak, PhD , an Independent Consultant and Research Associate at the National Preparedness Leadership Initiative at Harvard University will share insights into artificial intelligence implementation. Dr. Cha Dong-Cheol , Head of the Medical Innovation Center at Naver Healthcare Research Institute will deliver the closing keynote “Tech Titans in Health: Naver and Kakao’s Role in Transforming Healthcare.” Hon Pak , Senior Vice President and Head of the Digital Health Team at Samsung Electronics will deliver the opening keynote “Smart Hospital Revolution: Redefining Patient Care with Technology.” Dr. Hwang Hee , CEO of Kakao Healthcare will deliver the closing keynote “Tech Titans in Health: Naver and Kakao’s Role in Transforming Healthcare.” Dr. Kyung-Hwan Kim , Head of the Institute of Convergence Medicine with Innovative Technology at Seoul National University Hospital and Chair of the HIMSS24 APAC Steering Committee will deliver the opening keynote “Smart Hospital Revolution: Redefining Patient Care with Technology.” Explore the full list of esteemed speakers and all sessions for a view into the conference’s programming lineup. 2024 HIMSS APAC Health Conference & Exhibition Together, our community is creating tomorrow's health, and HIMSS24 APAC is going to be the best conference yet. Witness the best of Korean healthcare as it converges with the international offering HIMSS brings to the event. Register Now",
        "news_summary": "The 2024 HIMSS APAC Health Conference & Exhibition will be held from October 1-4 in Seoul, South Korea, featuring leading experts in artificial intelligence, smart hospitals, decentralized care, and cybersecurity. The event aims to drive digital transformation in South Korea's healthcare sector, following a recent memorandum of understanding between HIMSS, the Korea Hospital Association, and the Korea Health Information Services. The conference will run concurrently with the K-Hospital Healthtech Fair 2024 and will include keynotes from notable figures such as Brian R. Spisak, Dr. Cha Dong-Cheol, Hon Pak, Dr. Hwang Hee, and Dr. Kyung-Hwan Kim.",
        "sentiment": "positive",
        "keywords_list": [
            "AI",
            "Artificial intelligence",
            "cybersecurity",
            "healthcare",
            "Innovation",
            "digital transformation"
        ],
        "source_name": "HIMSS"
    },
    {
        "news_url": "https://www.himss.org/news/calderdale-and-huddersfield-nhs-foundation-trust-achieves-amam-stage-6-validation",
        "news_title": "Calderdale and Huddersfield NHS Foundation Trust Achieves AMAM Stage 6 Validation",
        "news_date": "2024-06-25:00",
        "news_content": "The Calderdale and Huddersfield NHS Foundation Trust has become the first institution in the UK and Europe to receive Stage 6 validation on the HIMSS Adoption Model for Analytics Maturity or “AMAM.” John Rayner, Senior Director of Analytics at HIMSS, praised CHFT's efforts in achieving AMAM Stage 6, particularly highlighting the self-service access to data provided to clinicians through a comprehensive knowledge portal. \"Clinicians have access to the data through a knowledge portal, from which they also receive an accompanying narrative that explains what the data—often numbers, charts, and graphs—is telling them,\" Rayner noted. This feature ensures that healthcare professionals can easily interpret and utilize the data, enhancing their ability to make informed decisions and improve patient outcomes. “It’s the culmination of a 10-year journey to embed technology and data science within our culture. This is deserved recognition for the hard work and team approach across CHFT and our colleagues at The Health Informatics Service,” said Rob Birkett, CHFT’s Chief Digital and Information Officer. “The reason why HIMSS is so well thought of is that its validations are approached from a patient-centered perspective. We knew it was the right thing to do and we’ve absolutely stuck with it. We should be very proud of what we've achieved as a Trust - it's not just what we've done, but it's how we've done it\" Julian Bates, CHFT’s Information Director, was both delighted and extremely proud of the accreditation: “This was a really great result and great team effort supported by many CHFT colleagues. We must thank HIMSS for their support throughout [...] the process. That said, it is important to acknowledge Business Intelligence and Data Science could not have moved forwards the past 3 to 4 years without the support and strength within THIS from Technical, Governance and Coding teams. This accreditation is a well done to all” As part of their commitment to digital health modernization, CHFT is also participating in the beta testing phase for the new AMAM modernization program, with the ambitious goal of reaching Stage 7 by the end of the year. CHFT also aims to achieve Stage 6 in EMRAM and INFRAM, showing their dedication to advancing their digital capabilities. The HIMSS AMAM maturity model measures the analytics capabilities that healthcare organizations have gained from having a strong analytics strategy and competency and advances an organization’s healthcare analytics regardless of the technologies installed. AMAM is a part of the HIMSS suite of maturity models , which offers frameworks on how to lead effective digital health transformation. Digital Health Transformation HIMSS has built evidence-based models and frameworks for the sole purpose of advancing health system capability. Whether your organization is looking to improve clinical outcomes, financial viability or operational efficiencies, this is your toolkit to drive healthcare forward. Learn More",
        "news_summary": "The Calderdale and Huddersfield NHS Foundation Trust (CHFT) has become the first institution in the UK and Europe to achieve Stage 6 validation on the HIMSS Adoption Model for Analytics Maturity (AMAM). This recognition highlights CHFT's decade-long journey to integrate technology and data science into their culture, providing clinicians with self-service access to data through a comprehensive knowledge portal. CHFT aims to reach Stage 7 by the end of the year and is also working towards achieving Stage 6 in EMRAM and INFRAM, demonstrating their commitment to digital health modernization.",
        "sentiment": "positive",
        "keywords_list": [
            "data",
            "data analytics",
            "Improving patient outcomes",
            "health systems",
            "health systems strategy",
            "Innovation"
        ],
        "source_name": "HIMSS"
    },
    {
        "news_url": "https://www.himss.org/news/hhs-releases-final-rule-establishing-provider-disincentives-information-blocking",
        "news_title": "HHS Releases Final Rule Establishing Provider Disincentives for Information Blocking",
        "news_date": "2024-06-24:00",
        "news_content": "On June 24, the U.S. Department of Health and Human Services (HHS) published a final rule establishing financial disincentives for healthcare providers found to have committed information blocking. In a corresponding press statement , HHS Secretary Xavier Becerra stated, “this final rule is designed to ensure we always have access to our own health information and that our care teams have the benefit of this information to guide their decisions. With this action, HHS is taking a critical step toward a health care system where people and their health providers have access to their electronic health information. “When health information can be appropriately accessed and exchanged, care is more coordinated and efficient, allowing the health care system to better serve patients. But we must always take the necessary actions to ensure patient privacy and preferences are protected – and that’s exactly what this rule does.” Information blocking by healthcare providers will be investigated by the HHS Office of Inspector General (OIG). Providers found to be information blocking will be subject to the following disincentives: Under the Medicare Promoting Interoperability Program, an eligible hospital (EH) or critical access hospital (CAH) that is found by OIG to have committed information blocking will not be a meaningful electronic health record (EHR) user during the calendar year of the EHR reporting period. This makes the EH not able to earn three quarters of the annual market basket increase they would have been able to earn for successful program participation; for CAHs, payment will be reduced to 100 percent of reasonable costs instead of 101 percent. This disincentive will start within 30 days of the final rule’s publication. Under the Promoting Interoperability performance category of the Merit-based Incentive Payment System (MIPS), a MIPS eligible clinician (including a group practices) found to be information blocking by OIG will not be a meaningful EHR user during the calendar year of the MIPS performance period. This ensures the EC will receive a score of zero for the MIPS Promoting Interoperability category, which is one quarter of the EC or group’s final MIPS score in a performance year. If an individual EC who is part of a larger group is found to be information blocking, the disincentive would only apply to the individual, not the entire group. This disincentive will be effective 30 days after publication of the final rule. HIMSS supported this change in public comments provided to HHS in January 2024 , suggesting that OIG had the ability to discern if an individual was participating in information blocking within the group but it wasn’t consistent with the rest of the group’s information sharing compliance and if so, the entire group shouldn’t be subject to a penalty. Under the Medicare Shared Savings Program, a healthcare provider that is an Accountable Care Organization (ACO), ACO participant or ACO provider or supplier who has committed information blocking may be ineligible to participate in the program for a period of at least one year and may not receipt revenue they would have otherwise earned through the MSSP. CMS also finalized that it would consider the relevant facts and circumstances, like the time since the information blocking conduct and the healthcare provider’s diligence correcting the problem, before applying a disincentive under the Shared Savings Program. The Office of the National Coordinator for Health Information Technology (ONC) and CMS will host a joint information session about the final rule on June 26, 2024, at 2 p.m. ET. More information on the session can be found at healthit.gov/informationblocking . HIMSS Public Policy and Advocacy The HIMSS policy team works closely with the U.S. Congress, federal decision makers, state legislatures and governments, and other organizations to recommend policy, and legislative and regulatory solutions to improve health through information and technology. Help Advance Health IT Policy",
        "news_summary": "The U.S. Department of Health and Human Services (HHS) has issued a final rule to impose financial penalties on healthcare providers engaged in information blocking. This rule aims to ensure that patients and healthcare providers have access to electronic health information, thereby improving care coordination and efficiency. The rule includes specific disincentives for hospitals, critical access hospitals, and clinicians found guilty of information blocking. The rule will be enforced by the HHS Office of Inspector General (OIG) and will take effect 30 days after publication. HIMSS has supported these changes, emphasizing the importance of individual accountability within group practices.",
        "sentiment": "positive",
        "keywords_list": [
            "Accountable care organizations",
            "ACO",
            "healthcare policy changes",
            "legislative advocacy healthcare"
        ],
        "source_name": "HIMSS"
    },
    {
        "news_url": "https://www.himss.org/news/himss-cybersecurity-expert-lee-kim-running-isc2-board-directors",
        "news_title": "HIMSS Cybersecurity Expert Lee Kim Running for ISC2 Board of Directors",
        "news_date": "2024-06-14:00",
        "news_content": "Lee Kim, HIMSS Senior Principal of Cybersecurity and Privacy, is running for the Board of Directors of ISC2, the world’s leading member association for cybersecurity professionals. Eligible ISC2 members in good standing can vote from June 18-July 2, 2024, for Lee Kim to join the board . Lee Kim is an industry-wide expert and educator in cybersecurity, data privacy, artificial intelligence, critical infrastructure and law. “Cyberattacks aren’t uniquely a healthcare problem, but the industry is a major target because of the abundance of financially valuable personal information,” she told USA Today in a recent interview . Speaking with the Chicago Tribune , she illuminated the latest HIMSS Cybersecurity Survey Report, which she authors annually, explaining that the healthcare industry has slightly increased its spending on cybersecurity. “Healthcare is one of the very few industries where pretty much everyone is impacted when a cyberattack happens,” she said. Lee Kim delivered a presentation on artificial intelligence, cybersecurity, data privacy and future implications this May at the 2024 National Conference of AIIC (Associazione Italiana Ingegneri Clinici) in Rome. She will serve as an expert panelist on a June 18 webinar on the use of AI in healthcare and its cybersecurity implications , hosted by HIT Answers. Join Us as We Reimagine Health Through Information and Technology At HIMSS, our vision is to realize the full health potential of every human, everywhere. Be part of the community that’s transforming the global health ecosystem with courage, curiosity and determination. Be part of what’s next for health",
        "news_summary": "Lee Kim, HIMSS Senior Principal of Cybersecurity and Privacy, is running for the ISC2 Board of Directors. She is a recognized expert in cybersecurity, data privacy, AI, and law. Kim highlighted the healthcare industry's vulnerability to cyberattacks and its increased spending on cybersecurity. She has been actively sharing her insights through interviews, reports, and presentations, including a recent one at the AIIC National Conference in Rome. She will also be a panelist in an upcoming webinar on AI in healthcare.",
        "sentiment": "positive",
        "keywords_list": [
            "Artificial intelligence",
            "cyber attacks",
            "data privacy",
            "AI",
            "healthcare",
            "cybersecurity"
        ],
        "source_name": "HIMSS"
    },
    {
        "news_url": "https://www.himss.org/news/himss-recommends-onc-ensure-true-health-equity-design",
        "news_title": "HIMSS Recommends ONC Ensure True Health Equity by Design",
        "news_date": "2024-06-14:00",
        "news_content": "HIMSS has delivered recommendations to the Office of the National Coordinator (ONC) for how diverse and underserved communities can be more preemptively engaged in the design, development and validation of health IT tools and systems. The Health Equity by Design Concept Paper details how ONC will use certification and other policy levers to ensure health equity is built into interoperable health information and technology systems. In a feedback letter to ONC , HIMSS offered recommendations to guide the office’s approach for addressing practical health IT coordination challenges facing underserved communities. Involvement of stakeholders from underserved patient populations from the beginning of the design, development and monitoring of health information and technology tools is critical for ensuring health equity. To facilitate engagement of these communities, HIMSS recommended ONC consider utilizing design thinking in the context of a learning health system framework to maximize equity focused innovation. User-centric design should be developed with a wide-range of health literacy and other capabilities of all patient populations. Scalable frameworks that consider the challenges faced by healthcare delivery sites focused on caring for underserved communities should be considered when health IT standards and systems are under development. HIMSS recommended that ONC include equity by design mechanisms through its federal coordination efforts, technical guidance and certification criteria specifications for equity metrics. To build trust in underserved communities, HIMSS called on ONC to improve and be more intentional when engaging in community collaboration with underserved communities, especially Tribal populations, when considering the design and implementation of health IT systems in a manner to promote health equity. HIMSS is invested in working with stakeholders across the sector to co-design actionable frameworks for industry and providers to incorporate health equity by design. To learn more about HIMSS efforts to promote health equity, please contact HIMSS Public Policy team at policy@himss.org . HIMSS Public Policy and Advocacy The HIMSS policy team works closely with the U.S. Congress, federal decision makers, state legislatures and governments, and other organizations to recommend policy, and legislative and regulatory solutions to improve health through information and technology. Help Advance Health IT Policy",
        "news_summary": "HIMSS has provided recommendations to the ONC on engaging diverse and underserved communities in the development of health IT tools. The recommendations emphasize the importance of involving stakeholders from these communities from the beginning stages and suggest using design thinking within a learning health system framework. HIMSS also calls for the inclusion of equity by design mechanisms in federal coordination efforts and stresses the need for intentional community collaboration, particularly with Tribal populations. HIMSS is committed to working with various stakeholders to create actionable frameworks for incorporating health equity by design.",
        "sentiment": "positive",
        "keywords_list": [
            "Legislative advocacy healthcare",
            "Community health initiatives",
            "population health",
            "healthcare policy changes"
        ],
        "source_name": "HIMSS"
    },
    {
        "news_url": "https://www.himss.org/news/apac-healthcare-professionals-invited-complete-emr-experience-survey",
        "news_title": "APAC Healthcare Professionals Invited to Complete EMR Experience Survey",
        "news_date": "2024-06-13:00",
        "news_content": "HIMSS is seeking insights from healthcare professionals who work with Electronic Medical Records at healthcare provider organizations in the Asia-Pacific region for a survey about the challenges associated with EMR use and how value is measured. The first 200 qualified participants to complete the survey will receive a $50 USD Amazon gift voucher once the survey closes. For verification purposes, participants must complete the survey using a work email address. Take the HIMSS Asia-Pacific EMR Experience Survey . The deadline to complete the survey is 31 July 2024 or once 200 qualified responses are received. The survey aims to inform and empower healthcare organizations to implement strategies that alleviate challenges associated with EMR use and improve the way they benefit health professionals and patients. Preliminary findings of the HIMSS Asia-Pacific EMR Experience Survey will be presented at the HIMSS24 Asia-Pacific Conference in Seoul, 1-4 October 2024, and the final report will be released in early 2025. Participation in this survey will contribute to shaping a healthcare environment that supports patient care and the wellbeing of health professionals through thoughtful EMR implementation. Join Us as We Reimagine Health Through Information and Technology At HIMSS, our vision is to realize the full health potential of every human, everywhere. Be part of the community that’s transforming the global health ecosystem with courage, curiosity and determination. Be part of what’s next for health",
        "news_summary": "HIMSS is conducting a survey among healthcare professionals in the Asia-Pacific region to gather insights on the challenges and value measurement of Electronic Medical Records (EMR). The first 200 qualified participants will receive a $50 Amazon gift voucher. The survey aims to help healthcare organizations improve EMR implementation and will be discussed at the HIMSS24 Asia-Pacific Conference in Seoul. The final report will be released in early 2025.",
        "sentiment": "positive",
        "keywords_list": [],
        "source_name": "HIMSS"
    },
    {
        "news_url": "https://www.himss.org/news/cut-through-hype-2024-himss-ai-healthcare-forum",
        "news_title": "Cut Through the Hype at the 2024 HIMSS AI in Healthcare Forum",
        "news_date": "2024-06-12:00",
        "news_content": "Healthcare and technology professionals will gather for two days of thought-provoking panels, visionary keynotes, expert-led education sessions, interactive networking, live solution demos, real-world case studies and more at the 2024 HIMSS AI in Healthcare Fo rum , Sept. 5-6 in Boston. The AI in Healthcare Forum cuts through the hype to offer a comprehensive showcase of the transformative potential of AI in healthcare. Registration is open for the most important AI event of the year dedicated to healthcare professionals. Keynotes will be delivered by Geeta Nayyar, best-selling author, technologist, chief medical officer of RadiantGraph; and Brian Anderson, president and CEO of Coalition for Health AI (CHAI) with Michael Pencina, chief data scientist at Duke University Health System. This year’s forum s peakers also include leaders and experts from Cleveland Clinic, Mayo Clinic Platform, Stanford Health Care, John Hopkins Medicine, Dana-Farber Cancer Institute, Mass General Brigham, Michigan Department of Health and Human Services and more. Esteemed panelists will explore the infrastructure necessary to power AI; the patient perspective on AI in healthcare; whether to use generative AI in healthcare; the navigation of ethics, regulation and innovation along the quest for AI governance; and lessons from the trenches when it comes to bringing AI to scale. Case studies will cover the use of AI in cybersecurity; the world’s first AI model for sepsis screening; generative AI in clinical workflows; and AI for overcoming healthcare’s mismatch between supply and demand. A speaker from the U.S. Department of Health and Human Services will deliver an updated look at the AI regulatory landscape. As generative AI continues to accelerate the pace of change in healthcare, it’s more important than ever to possess the knowledge, tools and confidence to navigate this complex landscape effectively. AI in Healthcare Forum Engage with experts at the forefront of innovation as they analyze the intricacies of integrating AI into healthcare settings. You’ll glean actionable insights from successful implementations and lessons learned from challenges encountered along the way. Register Now",
        "news_summary": "The 2024 HIMSS AI in Healthcare Forum will take place on Sept. 5-6 in Boston, featuring panels, keynotes, education sessions, networking, demos, and case studies. The event aims to showcase the transformative potential of AI in healthcare. Keynote speakers include Geeta Nayyar and Brian Anderson, among others. Topics will cover AI infrastructure, patient perspectives, generative AI, ethics, regulation, and real-world implementations. The forum will also address AI in cybersecurity, sepsis screening, clinical workflows, and supply-demand mismatches in healthcare. Experts will provide insights on navigating the complex AI landscape in healthcare.",
        "sentiment": "positive",
        "keywords_list": [
            "AI",
            "Artificial intelligence",
            "cybersecurity",
            "healthcare",
            "Innovation",
            "data",
            "data analytics",
            "healthcare policy changes",
            "Patient outcomes",
            "clinical innovations"
        ],
        "source_name": "HIMSS"
    },
    {
        "news_url": "https://www.himss.org/news/himss-calls-significant-investment-public-health-data-modernization-annual-ipps-response",
        "news_title": "HIMSS Calls for Significant Investment for Public Health Data Modernization in Annual IPPS Response",
        "news_date": "2024-06-11:00",
        "news_content": "HIMSS has reiterated its call for significant investment in public health information data modernization and interoperability capability. HIMSS submitted its call to action through public comments responding to a request for information (RFI) from the Centers for Medicare and Medicaid Services about methods to improve electronic reporting of public health data to state and local public health agencies. The RFI, which was part of CMS’s annual Inpatient Prospective Payment System proposed rule , asked stakeholders about potential methods, including changing the attestation measure for capability to report public health data electronically to a numerator/denominator quality measure. HIMSS indicated measuring success in reporting public health data is a goal, but the current lack of capability in many public health agencies to receive the data electronically would require a wide range of exemptions, limiting the value of a measure while placing additional burden on health systems. HIMSS continues to endorse significant IT infrastructure funding, with corresponding technical support and workforce development by HHS, as recommended in HIMSS 2022 Public Health Information and Technology Infrastructure Funding Report . In the response, HIMSS also supported proposed changes by CMS for electronic clinical quality measure (eCQM) reporting for both the Promoting Interoperability Program and the Inpatient Quality Reporting Program. The proposed changes included the addition of patient safety focused measures (measuring patient falls and post-surgical respiratory failure) to the self-selected menu for quality reporting starting in 2026, and increasing the number of eCQMs required for reporting, going from six to nine in 2026 and nine to eleven in 2027. HIMSS’s assessment of the new measures determined that the timeline to successfully implement the mechanisms for capturing and reporting the needed data to meet the measures was appropriate, and each of the new measures are meaningful and actionable, meaning improving measure performance should positively impact patient outcomes. HIMSS Public Policy and Advocacy The HIMSS policy team works closely with the U.S. Congress, federal decision makers, state legislatures and governments, and other organizations to recommend policy, and legislative and regulatory solutions to improve health through information and technology. Help Advance Health IT Policy",
        "news_summary": "HIMSS has called for significant investment in public health information data modernization and interoperability. They responded to a CMS RFI on improving electronic reporting of public health data, highlighting the need for IT infrastructure funding and workforce development. HIMSS also supported CMS's proposed changes for eCQM reporting, including new patient safety measures and an increase in required eCQMs. The HIMSS policy team continues to work with various stakeholders to recommend health IT policy improvements.",
        "sentiment": "positive",
        "keywords_list": [
            "Public health emergency preparedness",
            "Legislative advocacy healthcare",
            "Program evaluation public health",
            "Population health management",
            "Improving patient outcomes",
            "healthcare policy changes"
        ],
        "source_name": "HIMSS"
    },
    {
        "news_url": "https://www.himss.org/news/healthcare-students-practice-advocacy-himss-government-relations-team-during-dc-trip-hosted",
        "news_title": "Healthcare Students Practice Advocacy with HIMSS Government Relations Team During D.C. Trip Hosted by Arizona Chapter",
        "news_date": "2024-06-11:00",
        "news_content": "The HIMSS Arizona Chapter recently hosted a cohort of students studying healthcare at Bryan University on a trip to Washington, D.C., for an inside look at policy and advocacy. The students visited the HIMSS office in Virginia to learn about some of the current public policy priorities being led by the HIMSS Government Relations team. Arizona Chapter Advocate Marjorie Rosen organized the trip as part of the HIMSS Chapter Advocacy Program, which leverages HIMSS’s reach and resources to influence public policy to advance healthcare and population health for all. Marci Little, a health administration student at Bryan University, class of 2025, wrote the following summary of her experience. The healthcare students from Bryan University were given the opportunity to be in Washington, D.C., for a week from April 12-18. We were invited to participate in the school’s Paralegal Program trip. We got the chance to see memorials, monuments, The Supreme Court, Capitol Hill and so many other sites. For me, I was so glad to be able to see the monuments and memorials, but what I wasn’t prepared for was the amazing experience of advocating through HIMSS. This was the best most memorable part of the week for me! For three nights of the trip, we were given the basics of what advocacy is, how it works and what to expect by Marjorie Rosen, Program Director of Healthcare. Everyone had the opportunity to ask questions regarding advocacy and how it works. I knew about advocacy as I had to do a PPE in advocacy to get my associate’s degree. I started to see myself advocating after that assignment. My love of advocacy was fueled during this trip! We attended a meeting with HIMSS in D.C. They showed us everything they possibly could about advocacy. It was beyond amazing! I fell in love with advocacy. We met some amazing people and even got to take a few photos with them. Questions were asked and answered while each of us took notes, mentally or written. We had the chance to see Marjorie teach alongside the HIMSS group regarding what the MATCH IT Act is and how we could help. For our advocacy day on Capitol Hill, we were split into groups. Our job was to meet with our representatives and get them on board with the MATCH IT Act. I had the pleasure of being the speaker of our group at each of our meetings. I am not a great speaker, but I found my voice in advocating. If I took anything from this trip, it is that advocacy is needed to change things, whether it’s in healthcare, government or in your own life. I am so grateful for the opportunity we had to be a part of this during that week. If given the opportunity again, I would gladly take it! HIMSS Public Policy and Advocacy The HIMSS policy team works closely with the U.S. Congress, federal decision makers, state legislatures and governments, and other organizations to recommend policy, and legislative and regulatory solutions to improve health through information and technology. Help Advance Health IT Policy",
        "news_summary": "The HIMSS Arizona Chapter organized a trip for Bryan University healthcare students to Washington, D.C., to learn about policy and advocacy. The students visited various sites and participated in advocacy training led by Marjorie Rosen. They engaged in hands-on advocacy activities, including meetings on Capitol Hill to support the MATCH IT Act. The experience was highly educational and inspiring for the students, particularly Marci Little, who found a passion for advocacy.",
        "sentiment": "positive",
        "keywords_list": [
            "Legislative advocacy healthcare",
            "population health",
            "healthcare policy changes"
        ],
        "source_name": "HIMSS"
    },
    {
        "news_url": "https://www.himss.org/news/himss-signs-letter-supporting-oncs-mission-promote-adoption-health-it",
        "news_title": "HIMSS Signs Letter Supporting ONC’s Mission to Promote the Adoption of Health IT",
        "news_date": "2024-06-06:00",
        "news_content": "President Biden’s Fiscal Year 2025 (FY2025) proposed budget for the U.S. Health and Hyman Services (HHS) included $86 million for the Office of the National Coordinator for Health Information Technology (ONC), an increase of $17 million above the FY2024 enacted level. As Congress begins to draft their annual spending bills, HIMSS led a multi-stakeholder initiative urging the leaders of the Labor, HHS, and Related Agencies (Labor-HHS) Appropriations subcommittees to fully fund ONC at the president’s proposed FY25 budget request. This increase in funding would help advance interoperability and nationwide, standards-based health information exchange to support better health enabled by data. Read the full letter to congressional appropriations . HIMSS, along with AHIMA and CHIME, led the joint effort that garnered over 50 signers. The letter explained that this necessary funding boost would provide the agency with the resources they have long needed to better serve as the key partner to both public and private sector stakeholders to advance the health information and technology ecosystem. Without this much-needed increase, the organizations worry that they will be hard-pressed to successfully execute the many agency initiatives, and priorities of Congress and the Administration. ONC supports a wide array of initiatives aimed at advancing national goals for better, safer, and more equitable healthcare through a nationwide interoperable health IT infrastructure. These include ensuring technology solutions incorporate baseline cybersecurity and privacy requirements, a health equity by design philosophy for federal health IT programs, continued advancements in patient access to health information and meaningful engagement in their care, and working to advance U.S. public health data infrastructure modernization. To further engage in on this issue, please contact policy@himss.org . HIMSS Public Policy and Advocacy The HIMSS policy team works closely with the U.S. Congress, federal decision makers, state legislatures and governments, and other organizations to recommend policy, and legislative and regulatory solutions to improve health through information and technology. Help Advance Health IT Policy",
        "news_summary": "President Biden's proposed FY2025 budget includes an $86 million allocation for the Office of the National Coordinator for Health Information Technology (ONC), a $17 million increase from FY2024. HIMSS, AHIMA, and CHIME are advocating for Congress to fully fund this request to enhance health information exchange and interoperability. The increased funding aims to support various initiatives, including cybersecurity, health equity, patient access to health information, and public health data infrastructure modernization.",
        "sentiment": "positive",
        "keywords_list": [
            "Legislative advocacy healthcare",
            "Public-private partnerships health",
            "Federal health grants",
            "grants health programs",
            "healthcare policy changes"
        ],
        "source_name": "HIMSS"
    },
    {
        "news_url": "https://www.himss.org/news/himss24-europe-rome-makes-global-headlines",
        "news_title": "HIMSS24 Europe in Rome Makes Global Headlines",
        "news_date": "2024-06-05:00",
        "news_content": "The 2024 HIMSS European Health Conference and Exhibition was a landmark event for the European digital health community, bringing together approximately 2,500 healthcare executives, practitioners and professionals from 84 different countries at the iconic Centro Congressi La Nuvola in Rome. The conference, held from May 29-31, showcased the latest advancements in healthcare technology and provided a platform for critical discussions on the future of digital health in Europe and worldwide. One of the key highlights was the emphasis of digital health solutions and new health policies within Europe. The conference featured sessions and workshops that explored topics such as artificial intelligence in healthcare, telemedicine, and the integration of electronic health records. Journalists from around the world took notice of the conference’s major trends and topics, with dozens of in-depth stories being published in Italy, across Europe, and in both the Americas and Asia-Pacific. Highlights of the media coverage from HIMSSEU24 are shared below. One of Italy’s largest newspapers, La Repubblica, reported on the growing importance of digital health technology in modern healthcare systems. RAI News provided video coverage of the conference’s esteemed guests, Italy’s Minister of Health of the Government Orazio Schillaci and the incumbent Mayor of Rome Roberto Gualtieri. The Il Quotidiano del Lazio article noted Italy’s initiatives to adopt HIMSS digital maturity models, specifically EMRAM and INFRAM . HIMSS24 Europe addressed the region’s strategic initiatives in digital health, including the AI Act and the European Health Data Space, which aim to position Europe as a leader in digital health. Tagesspiegel , one of Germany’s largest daily newspapers, interviewed HIMSS CEO and President Hal Wolf, who highlighted these initiatives, underscoring their potential to drive significant advancements in healthcare technology and policy. Tagesspiegel also published stories on combatting workforce shortages as well as the Nordic Health 2030 ca m paign . The global reach of the conference was further highlighted in articles from leading Korean media outlets ET News and K orea Biomedical Review . The top Irish tech publication, Silicon Republic, featured winners of the HIMSS Startup Pitchfest , and one of Europe’s top healthcare podcasts, Faces of Digital H ealt h , published an episode on the highlights of the conference. The HIMSS24 Europe set the stage for future advancements in digital health in the region and will again as the 2025 HIMSS European Health Conference & Exhibition will take place in Paris, France, from 10-12 June 2025, at the world-famous venue, Palais de Congrès. As the conference came to a close, HIMSS President and CEO Hal Wolf spoke with Healthcare IT News , about next year’s HIMSS25 Europe in Paris and what to expect. The HIMSS European Health Conference and Exhibition is the destination to learn, connect, innovate Better patient outcomes and stronger workforces are a team project. At the HIMSS European Health Conference and Exhibition, we’ve built a programme to arm you and your peers with the insights you need to transform health systems back at home. Learn more",
        "news_summary": "The 2024 HIMSS European Health Conference and Exhibition in Rome gathered 2,500 healthcare professionals from 84 countries to discuss advancements in digital health. Key topics included AI in healthcare, telemedicine, and electronic health records. The event received extensive media coverage, highlighting Europe's strategic initiatives like the AI Act and the European Health Data Space. The conference set the stage for future advancements, with the next event scheduled for Paris in 2025.",
        "sentiment": "positive",
        "keywords_list": [
            "AI",
            "Artificial intelligence",
            "healthcare policy changes",
            "health systems",
            "Innovation",
            "Patient outcomes"
        ],
        "source_name": "HIMSS"
    },
    {
        "news_url": "https://www.himss.org/news/himss24-europe-draws-together-thousands-healthcare-leaders-build-tomorrows-health",
        "news_title": "HIMSS24 Europe Draws Together Thousands of Healthcare Leaders to Build Tomorrow’s Health",
        "news_date": "2024-06-03:00",
        "news_content": "Global and European leaders forged new pathways and partnerships to improve healthcare at the 2024 HIMSS European Health Conference and Exhibition, which convened more than 2,000 healthcare executives, practitioners and professionals from 84 countries in Rome to learn, connect and innovate. Esteemed participants included Italy’s Minister of Health of the Government Orazio Schillaci and the incumbent Mayor of Rome Roberto Gualtieri. Disability rights advocate and former NBC Euronews anchor Isabelle Kumar served as moderator for the conference’s most compelling sessions. In addition to hundreds of exhibitors and sponsors showcasing their latest innovations, speakers led in-depth discussions on AI in healthcare, interoperability, health equity, clinical decision supports, wearables, EMR adoption and predictive analytics. Sessions also offered cutting-edge insight into Europe’s current regulatory landscape, including the AI Act, the European Health Data Space, The European Health Union and the European Recovery and Resilience Fund. Keynote addresses were delivered by experts on the forefront of health, innovation and policy, including: Dr David Novillo-Ortiz, Unit Head, Data and Digital Health, WHO Regional Office for Europe Hela Ghariani, Co-Chair of the EU eHealth Network, Co-Head of the Digital Health Delegation, French Ministry of Labor, Health and Solidarity, France Henning Schneider, Chief Information Officer, Asklepios Kliniken, Germany John Riggi, Former FBI Senior Executive and Supervisory Special Agent, National Advisor for Cybersecurity and Risk, American Hospital Association, United States of America Marco Marsella, Director, Digital, EU4Health and Health Systems Modernisation, DG SANTE, European Commission Dr Waheed Arian, Humanitarian, innovator, former Afghan refugee, Arian Wellbeing Limited Hal Wolf, President & CEO of HIMSS Prof Ernst Kuipers, Board of Directors Member, HIMSS & Former Minister of Health, Welfare and Sport, The Netherlands, Vice President, Research, Nanyang Technological University, Singapore HIMSS recognized multiple healthcare systems during the Digital Maturity Awards Ceremony at HIMSS24 Europe for their outstanding achievements in enhancing clinical outcomes with the implementation of HIMSS maturity models. Five organizations achieved Stage 7 validations on EMRAM and 15 organizations achieved EMRAM Stage 6. Attendees received an inside look at Italy’s recently launched Fascicolo Sanitario Elettronico, a groundbreaking approach to health data that lets citizens trace their entire medical history online. Innovation funds like Smart&Start Italia are also helping cities across Italy build thriving healthcare startup scenes. Partners from the HIMSS Italian Community — including AISIS, AIIC, Donne 4.0 and Donne Protagoniste en Sanità — also hosted sessions throughout the week. Seven projects showcased advancements in cybersecurity, chronic condition management and patient-focused tools, aiming to improve healthcare outcomes: AI4HealthSec, WARIFA, FLUTE, EDiHTA, Gravitate-Health, Label2Enable, and ADLIFE. HIMSS Strategic Partner GVM Care & Research, led by its CIO Elena Sini, who is also the Chair of the HIMSS Board of Directors, opened the doors of its San Carlo Hospital, a hospital that has experienced heavy investment in technological innovation to improve its healthcare services. The highly anticipated Digital Nursing Summit at the conference was a two-part program that delved into the cutting-edge advancements in digital support for nursing care. In light of the ongoing, global workforce crisis, the second part of the summit focused on strategies to bolster and support nurses in their vital roles. Members of the HIMSS European Nursing Informatics Community and the Italian Nurses Association were in attendance, in addition to speakers such as Professor Pam Cipriano, president of the International Council of Nurses; Christine Antorini, nursing student and former Minister of Education in Denmark; and Matthew Little, associate chief nurse - Digital / chief nurse information officer (CNIO) at Gloucestershire Hospitals NHS Foundation Trust. HIMSS24 Europe showcased emerging healthcare solutions through Startup Pitchfest, offering a platform for innovative startups to address entrenched challenges faced by health systems and providers. Attendees witnessed insightful discussions on leveraging technology to promote health equity, refugee care and mitigate the impact of climate change. As announced in Rome during the closing keynote sessions, the 2025 HIMSS European Health Conference & Exhibition will take place in Paris, France, from 10-12 June 2025, at the world-famous venue, Palais de Congrès. Join Us as We Reimagine Health Through Information and Technology At HIMSS, our vision is to realize the full health potential of every human, everywhere. Be part of the community that’s transforming the global health ecosystem with courage, curiosity and determination. Be part of what’s next for health",
        "news_summary": "The 2024 HIMSS European Health Conference and Exhibition in Rome brought together over 2,000 healthcare professionals from 84 countries to discuss innovations in healthcare. Key topics included AI, interoperability, health equity, and predictive analytics. Esteemed speakers and participants included government officials, healthcare executives, and technology experts. The event featured the Digital Maturity Awards, showcasing advancements in digital health, and introduced Italy's new Fascicolo Sanitario Elettronico. The conference also highlighted various projects and initiatives aimed at improving healthcare outcomes and supporting the global healthcare workforce. The next HIMSS European Health Conference will be held in Paris in 2025.",
        "sentiment": "positive",
        "keywords_list": [
            "AI",
            "Artificial intelligence",
            "cybersecurity",
            "health equity",
            "clinical decision supports",
            "predictive analytics",
            "healthcare",
            "health systems",
            "innovation",
            "digital health",
            "healthcare outcomes",
            "healthcare workforce",
            "health data"
        ],
        "source_name": "HIMSS"
    }
]