[
    {
        "news_url": "https://about.bgov.com/news/obamas-endorse-harris-in-video-what-to-know-in-washington/",
        "news_title": "Obamas Endorse Harris in Video: What to Know in Washington",
        "news_date": "July 26, 2024 7:23 AM",
        "news_content": "Vice President Kamala Harris’ ascension to become the likely Democratic nominee is revealing the choppy political waters thatSen. Tammy Baldwinis maneuvering in battleground Wisconsin. But first, you should know:\nHarris said she pressed Israeli Prime Minister Benjamin Netanyahu toaccept a cease-firein the Israel-Hamas war during a meeting yesterday.The Trump campaignrefused to commit to a debatewith Harris just days after Trump said he wants to debate her several times.House Republicans got six Democrats to defect from President Joe Biden and vote for a symbolic resolution denouncing hisborder security policies.\nBarack and Michelle Obama endorsed Vice President Kamala Harris’ bid to become the Democratic nominee. A video released this morning shows the couple calling Harris to encourage her campaign.\nThe Obamas remain two of the most popular figuresin Democratic politics and their endorsement is sure to give another jolt to Harris’ candidacy, which has generated a surge of enthusiasm among party members.Read More\nAnother Harris endorsement comes from Sen. Tammy Baldwin(D-Wis.), who joined the vice president this week at a boisterous rally in the Milwaukee area. However, Baldwin is carefully riding Democratic politics in this roller coaster of an election year, a challenging balancing act in Wisconsin, a must-win state for Democrats if they have any hopes of retaining their Senate majority.\nBaldwin is banking that her 12 years in the Senate built on twin appeals to her liberal base and independents can help secure another term. “My record has shown that I really fight hard for Wisconsinites across the state,” Baldwin told reporters after the rally.Read More\nMore from the Harris Campaign:\nMeanwhile, Trump has refused to commit to a debatewith Harris with a campaign spokesperson saying the debate plans “cannot be finalized until Democrats formally decide” on their nominee: “It would be inappropriate to schedule things with Harris because Democrats very well could still change their minds.”\nBIDEN’S SCHEDULE\nHARRIS’ SCHEDULE\nCONGRESS’ AGENDA\nJustice Elena Kagan proposed Chief Justice John Roberts appoint a panel of judges to enforce the US Supreme Court’s code of conduct.\nThe Chinese-owned social media platform TikTok is battling a potential US ban with the signature tools of American democracy — lawyers, lobbyists and money.\nAn IT failure that caused millions of Microsoft Windows devices to crash, upending business across the globe, adds to the scrutiny that cloud providers are under as regulators start to more sharply examine consolidation in the industry.\nFederal regulators on Thursdayproposedthat broadcasters be required to disclose when they run political ads that use AI-generated content. But it was unclear whether the plan could take effect before the November elections.\nSix House Democrats broke ranksand voted for a nonbinding Republican-led resolution (H. Res. 1371) that condemned the Biden administration and Harris over their border-security policies:\nReps. Mary Peltola (Alaska), Jared Golden (Maine), and Marie Gluesenkamp Perez (Wash.), who all represent districts that preferred Trump to Biden in 2020;Rep. Henry Cuellar (Texas), who sometimes votes with Republicans and represents a district on the US-Mexico border;Rep. Don Davis (N.C.), elected by 5 percentage points in 2022, who’s seeking a second term in a swing district Republicans redrew more to their favor; andRep. Yadira Caraveo (Colo.), who joined the others in January to vote for a similar resolution to denounce Biden’s border policies. Caraveo, Colorado’s first Latina member of Congress, was elected by less than one percentage point in 2022 in the competitive and newly drawn 8th District.\nThe Federal Reserve is likely to signal next week its plans to cut interest rates in September, according to economists surveyed by Bloomberg News, a move they say will kick off reductions each quarter through 2025.\nApple Inc.is the latest company to agree to a set of voluntary safeguards for artificial intelligence crafted by PresidentJoe Biden’s administration as it tries to guide the development of the emerging technology and encourage firms to protect consumers.\nOpen artificial intelligence models that allow developers to customize them with few restrictions are more likely to promote competition, Federal Trade Commission ChairLina Khansaid, weighing in on a key debate within the industry.\nJustice Elena Kagan predicted “instability” and “uncertainty” at lower courts in cases following the Supreme Court’s blockbuster decision to overturn a longstanding regulatory doctrine governing how unclear laws are interpreted.\nAn anti-abortion group in Arizona is turning to the courts to prevent a ballot measure that would enshrine abortion rights in the state constitution from going before voters in November.\nTexas says the Biden administration is flouting a court’s ruling by enforcing a regulation requiring certain health service entities to give contraceptives to minors without parental consent, in opposition to state law.\nKashi Way became the first US Tax Court judge nominated by President Joe Biden to be confirmed to its 19-seat bench, as the Senate Finance Committee primed the judge confirmation pump with three more nominees.\nUS executives who visited China this week got the chance to meet with senior officials of President Xi Jinping’s government, but received conflicting signals over Beijing’s openness to foreign investment.\nThe Paris Summer Olympics that begin Friday include among the most public and controversial rollouts ever of algorithmic video surveillance, an AI event-security technology that uses machine learning to analyze video footage in real time to detect—and even predict—threats and other anomalies.\n— With assistance fromGreg Giroux.\nTo contact the reporter on this story:Brandon Leein Washington atblee@bgov.com\nTo contact the editors responsible for this story:Kayla Sharpeatksharpe@bloombergindustry.com;Giuseppe Macriatgmacri@bgov.com",
        "news_summary": "Vice President Kamala Harris is emerging as the likely Democratic nominee, with endorsements from prominent figures like Barack and Michelle Obama and Sen. Tammy Baldwin. Harris is actively engaging in political discussions, including pressing Israeli Prime Minister Netanyahu for a cease-fire in the Israel-Hamas conflict. The Trump campaign has refused to commit to debates with Harris. Meanwhile, six House Democrats defected to vote for a resolution denouncing President Biden's border security policies. Other notable events include discussions on AI regulations, Federal Reserve interest rate cuts, and political ads using AI-generated content.",
        "news_sentiment": "Neutral",
        "news_keywords": [
            "AI",
            "Artificial intelligence"
        ],
        "source_name": "bgov",
        "client_name": ""
    },
    {
        "news_url": "https://about.bgov.com/news/harris-now-dems-presumptive-nominee-what-to-know-in-washington/",
        "news_title": "Harris Now Dems’ Presumptive Nominee: What to Know in Washington",
        "news_date": "July 23, 2024 7:11 AM",
        "news_content": "Vice PresidentKamala Harrisbecame the presumptive Democratic presidential nominee last night when she surpassed the pledged delegate count needed to secure the nomination. But first, you should know:\nBloomberg Government delves into how aHarris victoryin November would shape the lame-duck session in Congress, with key issues like spending and defense still unresolved.EmbattledSecret Service DirectorKimberly Cheatle now faces animpeachment threat.The CEO ofCrowdStrikewas requested to urgently appear before a House committee.\nVice President Kamala Harris sealed her status as the presumptive Democratic nominee for president last night, after crossing the magic number of 1,976 pledged delegates she needed to clinch the nomination, according to an unofficial Associated Press tally.\n“It is my intention to go out and earn this nominationand to win,” Harris told workers Monday at her campaign headquarters in Wilmington, Del. “So in the days and weeks ahead, I, together with you, will do everything in my power to unite our Democratic Party, to unite our nation and to win this election.”\nDelegates will formalize their votes in the coming weeks. Earlier Monday, party leaders outlined a virtual balloting process to officially designate a nominee by Aug. 7. Harris will now recommend a running mate to those same delegates, who will ratify the slate at the party’s national convention in Chicago the week of Aug. 19 — if not through a similar virtual roll call in earlier in the month.Read More\nFormer Attorney General Eric Holderand his law firm, Covington & Burling, were tapped by Harris’ team to help her vet possible running mates. Holder is expected to run point on the vetting process for Harris, a source briefed on the matter said.Read More\nIn the meantime, Harris will launchher nascent presidential campaign in earnest today with a rally in Milwaukee seeking to answer the biggest question on skittish Democrats’ minds: How does she plan to beat Donald Trump?\nIt’s a sizable challenge for Harris,who must re-introduce herself to the country. That task will require reassembling the coalition of moderate and progressive voters that Biden rode to the White House four years ago, and overcoming dissatisfaction over the administration’s handling of the economy.Read More\nAlso Read:\nIf Harris wins the election,she would be in a better position than President Joe Biden — who is now a lame duck president — to immediately shape the final stretch of the 118th Congress. Lawmakers are considering lingering legislation on such key issues as farm policy, defense and appropriations.\nBiden’s endorsementof Harris makes lame-duck negotiations on government funding, and possibly the debt limit, more unpredictable. Republicans had already been debating whether to seek a spending deal in December or wait until 2025, when they may have more leverage.\nCongress also technically faces a Jan. 1 deadlineto lift or suspend the debt limit, but Treasury officials can buy more time with so-called “extraordinary measures.” Lawmakers weren’t certain if they would seek negotiations in the lame duck. If they don’t resolve the issue quickly, they’re guaranteed to face a deadline early in a new presidential administration.Read More\nBiden’s exit from the 2024 raceimmediately sparked speculation about whether Republicans could convince courts to keep the eventual Democratic nominee’s name from appearing on ballots or block access to Biden’s campaign dollars. Election law experts of all political stripes are largely in agreement so far that such challenges are likely to fail. But the unprecedented situation opens the door to aggressive and creative lawyering.Read More\nBIDEN’S SCHEDULE\nHARRIS’ SCHEDULE\nCONGRESS’ AGENDA\nRepublican House leaders plan to hold a vote this week on a resolution condemning the Biden Administration and Vice PresidentKamala Harrisover what they said is a “failure to secure the United States border.” Rep.Elise Stefanik(N.Y.) submitted the resolution.\nRepublican Rep.Nancy Mace(R-S.C.) said she plans to to bring articles of impeachment against Secret Service DirectorKimberly Cheatlevia a privileged motion, she said on X.\nThe significant step follows months of behind-the-scenes wrangling and failed attempts to fast-track the pieces of legislation.\nA US House committee called on the chief executive officer of CrowdStrike Holdings Inc. to testify on a defective software update that caused widespread global outages.\nThe role of the Joint Committee on Taxation—already crucial when Congress drafts tax legislation—could take on new significance after the fall of a legal doctrine empowering federal regulators, former staffers and members say.\nThe Energy Department would have 90 days to make decisions on liquefied natural gas export projects under a permitting reform plan unveiled Monday bySenator Joe Manchin.\nA stopgap measure that kept a key US financial regulator’s whistleblower office afloat during a funding crisis is set to expire unless lawmakers revive it, putting the cash-for-tips program in jeopardy.\nThe House on Monday passed legislation to study and carry out water resources projects across the country, a measure Congress reliably enacts every two years with bipartisan support.\nSocial media platforms enjoy immunity from liability under Section 230 for third-party content. But when it comes to defending their First Amendment rights, they paint themselves as content developers—in contradiction to their Section 230 arguments. The Supreme Court will eventually rule on—and curb—their immunity.\nThe US government and United Airlines Holdings Inc. will use a commercial aircraft to monitor greenhouse gases throughout the atmosphere, a first-of-its-kind collaboration that promises to vastly expand what scientists know about how planet-warming pollution behaves in the sky.\nCitizen groups are petitioning the EPA to revise pesticide regulations to prohibit PFAS and plastic containers that release the chemicals into stored pesticides, the latest move in an effort to force a ban of “forever chemicals” and technologies that produce them.\nThe Biden administration wants the US Supreme Court to step in and limit lower court orders that fully blocked it from extending protections against sex discrimination in education to transgender students.\nBristol Myers Squibb Co., andJohnson & Johnsonreceived a flood of support in their lawsuits seeking to scuttle a government drug price-setting program as various amicus briefs were filed in their favor at the Third Circuit.\nTo contact the reporters on this story:Brandon Leein Washington atblee@bgov.com;Jeannie Baumannin Washington atjbaumann@bloombergindustry.com\nTo contact the editors responsible for this story:Kayla Sharpeatksharpe@bloombergindustry.com;Giuseppe Macriatgmacri@bgov.com",
        "news_summary": "Vice President Kamala Harris has become the presumptive Democratic presidential nominee after surpassing the required delegate count. Harris plans to unite the Democratic Party and the nation to win the upcoming election. Former Attorney General Eric Holder will assist in vetting potential running mates. Harris faces the challenge of reassembling a coalition of moderate and progressive voters and addressing dissatisfaction with the current administration's handling of the economy. If elected, Harris would be in a strong position to influence key legislative issues. The article also discusses various political maneuvers and legislative actions in Congress, including potential impeachment threats and legislative reforms.",
        "news_sentiment": "Neutral",
        "news_keywords": [
            "CEO",
            "impeachment",
            "lawsuit"
        ],
        "source_name": "bgov",
        "client_name": ""
    },
    {
        "news_url": "https://about.bgov.com/news/trump-speech-cements-control-of-gop-what-to-know-in-washington/",
        "news_title": "Trump Speech Cements Control of GOP: What to Know in Washington",
        "news_date": "July 19, 2024 7:27 AM",
        "news_content": "During his speech at the Republican National Convention, Donald Trump basked in a moment that showed his grip on the party to be tighter than ever.\nThe GOP nominee began his 93-minute remarks,the longest ever for a nominee in the modern era, with calls for unity, though he later swerved into the America-first messages and off-the-cuff riffs that were hallmarks of his polarizing first term in the White House.\nTrump repeatedly decried illegal immigration,characterizing the migrant crisis as “a massive invasion at our southern border that has spread misery, crime, poverty, disease, and destruction to communities all across our land.” Those lines appeared more aimed at whipping up the MAGA faithful than winning over moderates and independents. But the contours of the race have made winning over new converts seem less urgent.\nThe triumphant set piece for Trump made for a stark contrastwith his rival, President Joe Biden, whose campaign is at its lowest moment as the candidate isolates at home due to Covid-19 while a rebellion simmers in his party that could force him off the ticket. Before Trump’s speech, Sen. Jon Tester (D-Mont.)joined calls for Biden to bow out, the second senator to do so.\nDemocrats, however, saw an openingin Trump’s speech, with the Democratic Congressional Campaign Committee saying it laid bare an “extreme agenda” and Biden’s campaign hitting him for sidestepping subjects like his pledge to pardon those convicted of participating in the Jan. 6, 2021, attacks on the US Capitol.Read More\nTrump also used his nomination speechto take aim at Biden’s electric vehicle policies, vowing to end them on his first day in office.Read More\nAdditionally, he reiterated an opennessfor Chinese automakers to build cars in the US as a way to boost the economy.Read More\nMore on Trump’s Speech:\nProject 2025:Conservatives behind an extensive plan for reshaping the US government known as Project 2025 see it as a resource for the next presidency of Trump, should he succeed in his bid to return to the White House. Bloomberg News explains the conservative policy roadmap.Read MoreAssassination Attempt:The FBI possesses technology to access the phone of the man identified as Trump’s shooter, people familiar said. The FBI appealed directly to Cellebrite, a digital intelligence company founded in Israel that supplies tech to several federal agencies, the people said.Read MoreMore Investigations:The Homeland Security Department’s watchdog is launching a third review into the Secret Service on “the extent to which the Secret Service plans and implements protective activities to ensure the safety and security of designated protectees.”Read More\nBIDEN’S SCHEDULE\nCONVENTION AGENDA\nBiden’s grasp on the Democratic presidential nomination appeared to be slipping Thursday, as he weighed increasingly public warnings from his party’s top lawmakers.\nBiden surrogates insisted that he was “not wavering”and remained dedicated to running, but the pressure kept building. The president, experiencing mild symptoms, fielded phone calls from his campaign team and discussed the political crisis threatening to consume his reelection bid.\nThe harshest blow:areport in the Washington PostthatBarack Obamatold allies Biden’s pathway to victory was greatly diminished and that he believes his former running mate needs to seriously consider if his campaign remains viable.\nDemocratic senators in competitive racesare on the precipice of calling on Biden to step aside, with the only question being when and how to announce their position, according to a Senate aide who requested anonymity to discuss internal thinking.Read More\nIn addition to lawmakers, some of Biden’s Cabinet membershave had private discussions among themselves as to whether it’s now time for his closest advisers to reckon with him about his increasingly dim electoral prospects, according to a person familiar with the matter.Read More\nNew Jersey Democrat LaMonica McIver,who’s likely to join the House in September, also will be her party’s nominee in the Nov. 5 general election for a full two-year term.\nLouisiana, where Democrats are likely to pick up a seatfrom Republicans under new district lines, today has the final candidate filing deadline for congressional primary-ballot access among the 50 states.\nState Sen. Cleo Fields (D), a House member in the 1990s, filed to run in the 6th District, where Rep. Garret Graves (R) isn’t seeking re-election after it was converted to a Black-majority constituency that leans Democratic.Louisiana’s five House members seeking re-election, including Speaker Mike Johnson (R) and Majority Leader Steve Scalise (R), are favored to win again.In Louisiana’s open primary Nov. 5, the same day as the general election, all candidates in a district appear on one ballot. A candidate who wins a majority of the vote is elected; otherwise, the top two vote-getters will compete in a Dec. 7 runoff. Louisiana will hold separate Democratic and GOP primaries for Congress starting in 2026.\nAcademics from universities including Johns Hopkins, Stanford and Princeton are helping lawmakers develop the understanding of artificial intelligence needed to regulate the technology.\nSome Democrats and Republicans in Congress have found something they agree on: They hate the Postal Service’s plan to process letters and packages more efficiently by shipping it out of state.\nAirlines around the world experienced disruption on an unprecedented scale after a widespread global computer outage grounded planes and created chaos at airports.\nAccording to the Federal Aviation Administration,United, Delta, American, and Spirit all temporarily grounded flights due to the IT-system meltdown that hobbled communication between aircraft and ground-control staff. In total, there were more than 1,000 flights canceled globally.Read More\nThe technology outagealso caused widespread disruption for commuters in New York and Washington, D.C.\nCrowdStrike warned customers that its Falcon Sensorthreat-monitoring product was causing Microsoft’s Windows operating system to crash. CEO George Kurtz said the issue has been “identified, isolated and a fix has been deployed,” according to a post on X. It’s not a security incident or cyberattack, he said.Read More\nRepublican presidential nominee Donald Trump’s pick of Senator JD Vance as his running mate has many in Silicon Valley rejoicing — they see the former venture capitalist as one of their own. But the tech world hasn’t always embraced Trump.\nHawaiian Electric Industries Inc.is among the companies that have tentatively agreed to pay more than $4 billion to resolve hundreds of lawsuits over the wildfires that ripped through Maui last year, according to people familiar with the deal.\nUS prosecutors said they need more time to finalize an agreement withBoeing Co.in which the planemaker will plead guilty to criminal conspiracy in connection with two fatal crashes of its 737 Max jetliner.\n— With assistance fromGreg Giroux.\nTo contact the reporters on this story:Kayla Sharpeatksharpe@bloombergindustry.com;Brandon Leein Washington atblee@bgov.com;Jeannie Baumannin Washington atjbaumann@bloombergindustry.com\nTo contact the editor responsible for this story:Giuseppe Macriatgmacri@bgov.com",
        "news_summary": "Donald Trump delivered a lengthy speech at the Republican National Convention, emphasizing his stronghold on the party and focusing on issues like illegal immigration and economic policies. In contrast, President Joe Biden's campaign is struggling, with increasing pressure from within his party to step aside. The article also covers various political developments, including Project 2025, FBI investigations, and disruptions caused by a global computer outage affecting airlines.",
        "news_sentiment": "Neutral",
        "news_keywords": [
            "AI",
            "Artificial intelligence"
        ],
        "source_name": "bgov",
        "client_name": ""
    },
    {
        "news_url": "https://about.bgov.com/news/biden-battles-covid-calls-to-quit-what-to-know-in-washington/",
        "news_title": "Biden Battles Covid, Calls to Quit: What to Know in Washington",
        "news_date": "July 18, 2024 7:07 AM",
        "news_content": "The House and Senate’s top Democrats are warning President Joe Biden his continued candidacy imperils the Democratic Party’s chances in the November election, according to multiple news reports.\nA flood of leaks detailed senior leaders in the Democratic Partywarning Biden personally that he was unlikely to defeat Donald Trump and is putting his congressional allies at risk.\nABC News reported late Wednesday that Senate Majority Leader Chuck Schumer(N.Y.) said it would be best if Biden bowed out of the race during a Saturday meeting in Delaware, and House Minority Leader Hakeem Jeffries (N.Y.), according to ABC, expressed a similar view in a one-on-one meeting last Thursday night at the White House.Read More\nBiden, meanwhile, can’t catch a break.The president’s hopes of counter-programming the Republican National Convention were dashed Wednesday after he learned he had contracted Covid-19,forcing him to cancel an appearancebefore a key Latino advocacy group. The diagnosis comes at a critical moment where he is trying desperately to prove that concerns over his age and mental acuity are overblown.Read More\nThe latest gambit to stabilize Biden’s reelection bidhas been a veer to the left, looking to bolster progressive support by floating ambitious new proposals to erase medical debt, cap rent increases, and impose sweeping new restraints on the Supreme Court. Biden today announced the cancellation of an additional $1.2 billion in student debt for 35,000 public servants, the latest effort to deliver on one of his signature initiatives.Read More\nHis campaign has also flooded Washington with memos:to lawmakers, insisting he would remain in the race; to donors, promising a viable path remains; and to the media, arguing the dynamics of the race haven’t changed.\nSenior Democrats considered, then abandoned,a bid to formalize his nomination early, while some allies pointed to the assassination attempt on Republican rival Donald Trump to argue the party couldn’t afford the chaos of a ticket change. Biden himself has held a series of calls and video teleconferences with skeptical members on Capitol Hill.Read More\nBIDEN’S SCHEDULE\nCONVENTION AGENDA\nThe Republican party downsized its policy platform under Donald Trump to limit swing-voter controversy.\nShould Trump win back the presidency,his policy agenda — from abortion to trade and taxation —would face opposition from Democrats, divisions among Republicans, and pressure from lobbying interests that won’t surrender willingly.\nThe party’s new platform is light on the detailsand largely focuses on broad Republican goals like lowering inflation, cutting regulations, and securing the southern border with Mexico. It highlights Trump’s populism on trade policy.\nThe margins in Congress,if still slim next year, will frustrate the executive agenda, no matter who wins in November, Kate Ackley and Zach C. Cohen report.Read More\nAlso Read:What to Watch in Trump’s First Speech to GOP Since Shooting\nThe Homeland Security Department agreed to make Secret Service Director Kimberly Cheatle available to testify before the House Oversight and Accountability Committee on the Trump assassination attempt, but the agency is pushing back on the July 22 date the panel has demanded.\nDHS cited Cheatle’s obligationsat the RNC in a Wednesday letter to Oversight Chair James Comer (R-Ky.) seeking another date, Ellen M. Gilmer reports. The House panel subpoenaed Cheatle on Wednesday when the DHS hadn’t committed to a date.\nMeanwhile, there are new calls for Cheatle’s resignation.“The nation deserves answers and accountability. New leadership at the Secret Service would be an important step in that direction,” Senate Minority Leader Mitch McConnell (R-Ky.) said in a post on X Wednesday. Speaker Mike Johnson (R-La.) also on Wednesday called on Cheatle to resign.Read More\nAt the RNC, senators confronted Cheatle Wednesday about what they say has been insufficient information following Saturday’s shooting.Read More\nDHS’s internal watchdogannounced a probeWednesday to assess how the Secret Service’s counter-sniper team responds to threats at events. The office is also reviewing security plans for Trump’s Pennsylvania campaign rally.Read More\n“I can tell you that I have not resigned nor have I spoken to any so called allies,” Sen. Bob Menendez told CBS New York’s Christine Sloan on Wednesday.\nRussia’s top diplomat signaled a preference for Republican presidential candidateDonald Trumpand especially his running mateJD Vance, praising their vocal interest in cutting a deal to end the war in Ukraine.\nUS Special Counsel Jack Smith filed a notice of appeal with a federal court in Florida to challenge a judge’s decision earlier this week dismissing charges againstDonald Trumpover mishandling classified information and obstruction.\nDemocratic officials in New Jersey’s 10th District are likely to nominate Newark City Council President LaMonica McIver at a convention today to replace the late ex-Rep. Donald Payne Jr. (D) on the Nov. 5 general election ballot.\nMcIver’s backing from many state and local party leadershelped propel her to victory in a special Democratic primary on Tuesday, making her a prohibitive favorite to win a Sept. 18 special general election and complete the remainder of Payne’s unexpired term in New Jersey’s most overwhelmingly Democratic district.\nThe agency missed a June 22 deadline required by the 2022 Water Resources Development Act to submit a report outlining the elimination of hydropower at multiple dams operating in the populous Willamette River Basin.\nThe Biden administration on Thursday will unveil 17 cutting-edge technologies it’s going to test in federal buildings, part of a $9.6 million effort to boost climate tech products at the edge of commercialization.\nThe Biden administration is launching a new technical assistance program to boost investment in Latin America and the Caribbean, as regional officials meet in Washington for talks on efforts to spur development, create jobs and counter migration pressures.\nPresident Joe Biden’s second attempt at securing billions in student loan forgiveness is well within his authority, administration officials said in a brief urging the Supreme Court to nix a challenge to the effort brought by GOP-led states.\nThe US economy grew at a slight pace heading into the third quarter, with a number of regions noting flat or declining activity, the Federal Reserve said in its Beige Book survey of regional business contacts.\nVice Admiral Brad Cooper, Deputy Commander of the US Central Command, says the pier effort accomplished what was intended and the effort has “transitioned” to sending aid from Cyprus to the Israeli port of Ashdod.\nWomen were more than twice as likely to die in or around childbirth in some US states with severe abortion restrictions compared to those with greater access, researchers said, and disparities could worsen as access to the procedure narrows.\nNew oil drilling permits on nearly 120,000 acres of public land in Wyoming were temporarily paused by a federal court Tuesday.\nSeveral of the world’s largest carmakers, including Toyota Motor Corp. andGeneral Motor Co., are unlikely to meet new US greenhouse gas emission targets by 2032, according to analysis by Greenpeace, in a sign they need to accelerate their adoption of electric vehicles to avoid penalties.\nTo contact the reporters on this story:Brandon Leein Washington atblee@bgov.com;Jeannie Baumannin Washington atjbaumann@bloombergindustry.com\nTo contact the editors responsible for this story:Kayla Sharpeatksharpe@bloombergindustry.com;Giuseppe Macriatgmacri@bgov.com",
        "news_summary": "Top Democrats are urging President Joe Biden to reconsider his candidacy for the upcoming election, fearing it jeopardizes the party's chances against Donald Trump. Biden's recent Covid-19 diagnosis and efforts to appeal to progressive voters by proposing ambitious policies have added to the campaign's challenges. Meanwhile, the Republican party, under Trump, has simplified its policy platform to avoid controversy. The Secret Service is under scrutiny following an assassination attempt on Trump, with calls for leadership changes. Additionally, Biden's administration is focusing on climate tech, student loan forgiveness, and boosting investment in Latin America.",
        "news_sentiment": "Negative",
        "news_keywords": [
            "resignation",
            "resigns"
        ],
        "source_name": "bgov",
        "client_name": ""
    },
    {
        "news_url": "https://about.bgov.com/news/harris-rise-spurs-downballot-query-what-to-know-in-washington/",
        "news_title": "Harris’ Rise Spurs Downballot Query: What to Know in Washington",
        "news_date": "July 25, 2024 7:14 AM",
        "news_content": "Democrats and Republicans are scrambling to set the narrative around Vice President Kamala Harris as they weigh her impact oncompetitive downballot racesthat could decide control of Congress. But first, you should know:\nCongressional Democrats in tight races this fall are largely embracing the energy and fundraising prowess Vice President Kamala Harris is bringing to this fall’s campaign, even as Republicans insist they can link vulnerable Democrats to her and the Biden administration’s most unpopular policies.\nIt may be weeks before congressional campaign committeessee decisive polling on how Harris’ ascension as the party’s new standard bearer will help — or hurt — House and Senate Democrats. Until then, both parties will race to define the vice president. Their efforts could impact not just the presidential race, but also control of Congress.\nAs for Biden, the president sought to define his legacyyesterday evening with an 11-minute Oval Office address — one that he has staked on defending US institutions from Donald Trump. He cast his exit from the race, made under intense pressure from fellow Democrats, as an act of self-sacrifice because “nothing can come in the way of saving our democracy.”\nAddressing voters casting ballots in the fall,Biden said, “the great thing about America is here, kings and dictators do not rule. The people do. History is in your hands. The power is in your hands.” Biden went on to recognize, “there’s a time and a place for new voices, fresh voices, yes — younger voices.”\nIt was a tacit admissionof how a calamitous debate performance had devastated confidence in the president’s ability to serve four more years in the job, effectively ending a five-decades long political career.Read More\nBIDEN’S SCHEDULE\nHARRIS’S SCHEDULE\nCONGRESS’ AGENDA\nKamala Harris’ support for a strong defense budget and years of building Indo-Pacific region ties will bolster the US’s global posture as well as an alliance with Australia and the United Kingdom, according to leading national security Democrats.\nPresidentJoe Bidenframed his momentous decision to drop out of the 2024 race as a bid to unify the nation under a new generation of leaders, in his first speech since ending his reelection campaign and political career.\nBarack Obama plans to endorse Vice President Kamala Harris for president soon, NBC News reports, citing four people familiar with their discussions.\nAs a 2019 presidential candidate,Kamala Harrispledged to ban fracking. Now Republicans are betting her opposition to the drilling technique will hurt her at the polls.\nDonald Trumpattacked Democrats on abortion, seeking to position himself as a moderate voice on the issue as he pivoted to a new general election challenger, Vice PresidentKamala Harris.\nVice President Kamala Harris is set to hold a campaign event in Atlanta, Georgia on July 30, the Atlanta Journal-Constitutionreports, citing an official familiar with the VP’s schedule.\nThe ballot is crowded, but attention and vitriol surround front-runners Abe Hamadeh and Blake Masters, who ran in unsuccessful 2022 races. “It’s teaching us something about the new world of politics in Arizona, and I imagine nationally as well,” said one political consultant.\nFederal appeals judge Stephanos Bibas was so concerned over the blowback from a 2020 opinion he authored rejecting a Trump election-related challenge that he told his children to be careful when answering the door at their home.\nThe BGOV OnPoint detailing potential committee leadership changes has been updated with information on additional candidates for House Republican roles and the Senate Foreign Relations shuffle after Sen. Bob Menendez’s conviction.\nThe House on Wednesday voted 416-0 on a measure (H.Res. 1367) to create a team of seven Republicans and six Democrats to examine security lapses that led to the recent shooting that wounded Trump, killed one person, and injured two others.\nThe missive included a range of questions for the top executive and raised concerns about Delta’s compliance with rules requiring airlines to provide refunds for extreme flight delays and cancellations.\nHouse members voted 210-205 to pass their fiscal 2025 Interior-Environment appropriations bill Wednesday night.\nTwo of President Joe Biden’s US Tax Court judge picks moved a step closer to confirmation in the Senate on Wednesday.\nUBS Group AGwas asked by a powerful US lawmaker about whether the bank it acquired,Credit Suisse Group AG, failed to report an American accused of evading taxes on $350 million in income.\nPresident Biden signed an executive order setting up an emergency board to help resolve an ongoing dispute between the New Jersey Transit Rail and the Brotherhood of Locomotive Engineers and Trainmen, according to a statement issued by the White House.\nBoeing Co.has completed an agreement with the US government to plead guilty to criminal conspiracy in connection with two fatal crashes of its 737 Max jetliner, setting the stage for a possible courtroom confrontation with relatives of those who were killed.\nA little-known federal agency is quickly becoming a permanent fixture in the permitting world, doubling its staff, bringing in-house much of the work it used to have to contract out, and spreading the word about what it can do for developers and local governments across the US.\nMakers of health-related mobile apps and other businesses soon covered by the Federal Trade Commission’s amended rule on health data breach notifications set to take effect July 29 could have to endure increasing litigation.\nThe EPA will reveal on Thursday the first recipients of a new grant program meant for communities long suffering from environmental and climate injustice.\nThe funding mechanism for a Federal Communications Commission broadband subsidy is “‘incompatible with our constitutional structure’” the en banc Fifth Circuit ruled Wednesday, in striking the scheme down.\nBloomberg Law today debutedthe 2024 honorees of “They’ve Got Next: The 40 Under 40,”the fourth-annual special report recognizing the accomplishments of stellar young lawyers.Read More\nSome of this year’s honorees scored government-adjacent wins, including:\nTo contact the reporters on this story:Brandon Leein Washington atblee@bgov.com;Jeannie Baumannin Washington atjbaumann@bloombergindustry.com\nTo contact the editors responsible for this story:Kayla Sharpeatksharpe@bloombergindustry.com;Giuseppe Macriatgmacri@bgov.com",
        "news_summary": "The article discusses the political maneuvering by Democrats and Republicans regarding Vice President Kamala Harris and her impact on upcoming congressional races. Democrats are leveraging her energy and fundraising abilities, while Republicans aim to link her to unpopular policies. President Biden has exited the 2024 race, framing it as a move to protect democracy and usher in new leadership. Kamala Harris is expected to bolster US global posture with her defense budget support and Indo-Pacific ties. Barack Obama plans to endorse Harris for president. The article also touches on various political events and decisions, including Biden's executive orders, legislative votes, and legal matters involving Boeing and UBS.",
        "news_sentiment": "Neutral",
        "news_keywords": [],
        "source_name": "bgov",
        "client_name": ""
    },
    {
        "news_url": "https://about.bgov.com/news/peek-into-harris-network-what-to-know-in-washington/",
        "news_title": "Peek Into Harris’ Network: What to Know in Washington",
        "news_date": "July 24, 2024 7:15 AM",
        "news_content": "From Gen Z to tech executives to the Divine Nine, Kamala Harris’ network of advisers and allies is both eclectic and expanding rapidly as she mounts a presidential campaign in just a little over the three months. But first you should know:\nDemocratic Party officials will meet today tofinalize a rule changeto allow Harris to formally lead their presidential ticket.In the Senate,Bob Menendez’sresignation next month will open a leadership post on the foreign policy panel.Hundreds of police officers from New York City and elsewhere will guard the Capitol today asIsraeli Prime Minister Benjamin Netanyahuaddresses a joint meeting of Congress.\nVice President Kamala Harris is known for keeping a small clubof informal advisers.\nHer husband, former DLA Piper lawyer Douglas Emhoff; sister, Maya Harris; and brother-in-law Tony West, who is senior vice president and chief legal officer for Uber, are among her closest advisers. As Harris seeks the presidency and courts party donors, that group is expanding.\nHarris will be able to lean on support from the Senate’s younger generation of Democrats and even some Republicans like-minded on policy priorities during her four years in the Senate.\nThe vice president also has former aides and allies scattered around the lobbying, consulting, and business sectors from Sacramento to Washington, D.C. Additionally, members of Black sororities and fraternities, known collectively as theDivine Nine, will be critical in her campaign for the White House.Read More\nAs Harris campaigns, a panel of Democratic stalwarts will meet todayto complete a rule change to allow Harris to accept her party’s nomination, weeks in advance of the party’s convention in Chicago.\nEconomists are scouring Harris’ recordas a senator and, before that, California’s attorney general, for clues about her economic agenda. While she has yet to map out her proposals, economists expect her to adhere to the Biden administration’s policy mix.\nMeanwhile, Donald Trump’s campaign has filed a complaintwith the Federal Election Commission claiming that the transfer of Biden’s $96 million campaign war chest to Harris violates the law.\nTrump also plans to stop holding outdoor rallies, NBC reports. The campaign currently plans to hold indoor rallies. However, it is possible that Trump will participate in smaller outdoor events or larger rallies in facilities where entrances are more controlled and there are not issues with high ground.Read More\nBIDEN’S SCHEDULE\nHARRIS’S SCHEDULE\nCONGRESS’ AGENDA\nWall Street’s Democratic donors have a clear mandate after several rudderless weeks fretting over PresidentJoe Biden’s drag on the party’s chances of winning the White House and Congressional majorities.\nAttorneys are opening their wallets for Vice President Kamala Harris, who has risen to the top of the Democratic ticket to replace President Joe Biden.\nAdvisers forDonald Trumphave floated the idea of demanding NATO allies spend 3% of gross domestic product on defense, a higher target than alliance members have agreed to and a warning shot that signals even more tension if he returns to the White House.\nIsraeli far-right cabinet memberItamar Ben Gvirtook the unusual step of endorsingDonald Trumpas the next US president, saying a return of the ex-leader would bolster the chances of victory against Iran’s allied militant groups and the Islamic Republic itself.\nElon Muskconfirmed Tuesday that he was “making some donations” to a super political action committee supportingDonald Trump’s presidential campaign, though at a “much lower level” than has been reported.\nSen. Bob Menendez’s resignation next month will remove one of the Democratic caucus’ foremost defense hawks and allies of Israel, along with a longtime advocate for immigration changes.\nThe Senate on Tuesday passed legislation aimed at cracking down on the proliferation of sexually explicit deepfakes generated by artificial intelligence—addressing a bipartisan concern as the emerging technology has become more accessible and sophisticated.\nMore than half of President Joe Biden’s federal appellate court appointments so far were in their 40s or younger when they joined the bench, the highest share for any modern Democratic president, a Bloomberg Law analysis shows.\nDemocrats honed in on the risk of discrimination by AI tools at a House Financial Services hearing Tuesday, quizzing witnesses about how to protect consumers in the financial and housing industries.\nPresident Joe Biden nominated David Samuel Johnson to serve as inspector general for the Treasury Department Inspector General for Tax Administration, the White House announced Tuesday.\nThe US International Trade Commission’s authority in patent disputes should be reined in by Congress, intellectual property professionals told a US House subcommittee.\nDelta Air Linesmust make clear to all its customers experiencing cancellations and significant delays that they are entitled to refunds as a matter of law, Senate Commerce Committee ChairMaria Cantwellsaid in a letter to Delta CEOEd Bastian.\nHouse leaders Tuesday pulled from floor consideration a bill that sought to prioritize nuclear energy and domestic security over other federal renewable energy programs after conservatives balked at sections of the bill.\nHundreds of police officers from New York City and other jurisdictions will help guard the US Capitol as large protests are expected when Israeli Prime MinisterBenjamin Netanyahuaddresses a joint meeting of Congress on Wednesday.\nFigures due out Thursday are expected to show the economy grew 2% in the second quarter. After the 1.4% growth of the previous quarter, that would be the slowest consecutive quarters of growth since 2022. The question now is how much will the economy decelerate and for how long?\nA federal judge rejected a small Pennsylvania company’s challenge of the Federal Trade Commission’s ban on noncompete contracts, creating a divide in the judiciary over the regulator’s powers.\nHackers have leaked internal documents stolen fromLeidos Holdings Inc., one of the largest IT services providers to the US government, according to a person familiar with the matter.\nThe chair of a New York-based private equity firm has committed to spending $30 million to launch a center that’s focused on overhauling the US Supreme Court.\nThe safeguards preventing the president from firing National Labor Relations Board members and the agency’s in-house judges are probably unconstitutional, a federal judge said in an order explaining his earlier directive blocking an administrative case againstSpaceX.\nTo contact the reporters on this story:Brandon Leein Washington atblee@bgov.com;Jeannie Baumannin Washington atjbaumann@bloombergindustry.com\nTo contact the editors responsible for this story:Kayla Sharpeatksharpe@bloombergindustry.com;Giuseppe Macriatgmacri@bgov.com",
        "news_summary": "Kamala Harris is rapidly expanding her network of advisers and allies as she prepares for a presidential campaign. Democratic Party officials are finalizing a rule change to allow her to lead their ticket. Harris has support from younger Senate Democrats and some Republicans. Her campaign will also rely on members of Black sororities and fraternities. Meanwhile, Donald Trump’s campaign has filed a complaint about the transfer of Biden’s campaign funds to Harris. Trump plans to hold indoor rallies. Wall Street donors are supporting Harris, while Trump’s advisers suggest increasing NATO defense spending. Israeli cabinet member Itamar Ben Gvir endorsed Trump. Elon Musk confirmed donations to a pro-Trump super PAC. The Senate passed legislation on AI-generated deepfakes. Biden’s judicial appointments are notably young. The House discussed AI discrimination risks. Biden nominated David Samuel Johnson as Treasury Inspector General. The US International Trade Commission’s patent authority is under scrutiny. Delta Air Lines must clarify refund policies. House leaders pulled a nuclear energy bill. Protests are expected during Netanyahu’s Congress address. Economic growth figures are due. A judge upheld the FTC’s ban on noncompete contracts. Hackers leaked documents from Leidos Holdings. A private equity firm is funding a Supreme Court overhaul center. A judge questioned the constitutionality of firing NLRB members.",
        "news_sentiment": "Neutral",
        "news_keywords": [
            "AI",
            "Artificial intelligence",
            "cyber attacks",
            "data breach",
            "hack"
        ],
        "source_name": "bgov",
        "client_name": ""
    },
    {
        "news_url": "https://about.bgov.com/news/trump-talks-taxes-tariffs-taiwan-what-to-know-in-washington/",
        "news_title": "Trump Talks Taxes, Tariffs, Taiwan: What to Know in Washington",
        "news_date": "July 17, 2024 7:13 AM",
        "news_content": "Donald Trump sat down with Bloomberg Businessweek for a wide-ranging, 90-minute interview about the state of the US economy and business—and his agenda for a potential second White House term.\nTrump was clear about his intentionsif returned to power in the interview, which was conducted just weeks before he was set to formally receive the Republican Party’s nomination for president. He boiled his economic agenda down to “low interest rates and taxes,” claiming there was a “tremendous incentive to get things done and to bring business back to our country.”\nWith Democrats mired in turmoilover whether to replace President Joe Biden on the ticket and polls showing Trump gaining ground in the swing states that will determine the outcome of November’s election, Republicans stand poised to potentially have control of the White House and both chambers of Congress, allowing them to usher in a sweeping slew of policy changes.\nBloomberg’s Nancy Cook delves into five takeawaysfrom the June 25 sit-down interview conducted at the former president’s Mar-a-Lago golf resort in Florida.Read More\nBIDEN’S SCHEDULE\nCONVENTION AGENDA\nThe Secret Service boosted security around Trumpafter picking up intelligence in recent weeks of an Iranian plot to assassinate him, people familiar with the matter said, adding that the threat was separate from the attempt on his life last weekend.\nThere’s no sign of any linkbetween the Iranian plot and Thomas Matthew Crooks, the 20-year-old man accused of shooting at and wounding Trump at a rally in Pennsylvania on Saturday. The Iranian threat appeared to be tied to a wider pattern of threats against ex-Trump officials stemming from the US killing of Qassem Soleimani in 2020, when Trump was president, the Biden administration said.\n“We have been tracking Iranian threatsagainst former Trump administration officials for years, dating back to the last administration,” National Security Council spokesperson Adrienne Watson said in a release. “These threats arise from Iran’s desire to seek revenge” for killing Soleimani, the head of Iran’s Revolutionary Guard Corps, she said.\nSecret Service Scrutiny:Probes into the security failures that allowed Saturday’s attack on Trump face political and bureaucratic hurdles that threaten to undermine the growing web of investigations.Read MoreAssassination Attempt Briefing:The Justice Department, Secret Service, and FBI will brief senators today on the attempted killing of Trump, Senate Majority Leader Chuck Schumer’s (D-N.Y.) office said.Read MoreInternal Probe:The Homeland Security’s inspector general also has opened an investigation into the Secret Service’s protection plan for Trump’s campaign rally July 13.Read More\nNikki Haleyonce calledDonald Trump“totally unhinged” and “diminished.” Florida GovernorRon DeSantispreviously said the former president would embrace the most “worthless Republicans” if they “kiss the ring.”\nGOP lawmakers vying for their party’s top job in the Senate have been busy in Milwaukee wooing their fellow lawmakers, donors, and party loyalists as they seek to build political capital for their bids to replace Senate Minority Leader Mitch McConnell (R-Ky.).\nRepublican National Committee ChairmanMichael Whatleywarned against complacency when his party concludes its official nominating jamboree this week with polls predicting ex-PresidentDonald Trumpprevailing over PresidentJoe Bidenin the November election.\nPresidential candidate Donald Trump’s pick for running mate isJD Vance, a memoirist turned senator who has been very critical of China across a range of issues.\nDonald Trump’s pick of SenatorJD Vanceas his running mate Monday hardens the Republican party’s shift toward trade protectionism and positions a successor to entrench the viewpoint for years to come.\nGroups lobbying for rail reform see Vance’s new profile and House lawmakers introducing similar legislation last week as providing momentum for the measure.\nVenture capital investors Marc Andreessen and Ben Horowitz plan to donate a significant amount to Donald Trump’s campaign for president, according to a person familiar with their plans, making the famous VC duo the latest tech investors to throw their support to the Republican.\nPresidentJoe Bidensaid condemnation of the assassination attempt onDonald Trumpshould be joined by criticism of violence against Black Americans, rejection of political extremism and support for gun control, as he returned to the campaign trail in search of a path forward for his beleaguered campaign.\nElon Musksaid he will relocate the headquarters for X and SpaceX to Texas, adding more fuel to the billionaire’s efforts to align himself with the political right and distance himself from left-leaning California.\nElon Musk is going all in on right-wing politics.\nThe winner of Tuesday’s Democratic primary will be a shoo-in to fill out the unexpired term of the late Rep. Donald Payne Jr.\nSen. Bob Menendez (D-N.J.) faced a chorus of calls to resign after his corruption conviction.\nTaiwan’s premier touted his island’s moves to better defend itself, afterDonald Trumpdeclared the chip hub “should pay” for US protection against Chinese military aggression.\nThree members of Congress, at least two billionaires, and one former vice president are among the newest donors to Rep. Matt Gaetz’s Republican primary opponent.\nSen. Markwayne Mullin (Okla.) and Reps. Dave Joyce (Ohio) and Max Miller (Ohio)joined billionaires Paul Singer and Stan Druckenmiller and former Vice President Dan Quayle in donating to Aaron Dimmock, a Navy veteran opposing Gaetz in the Aug. 20 primary in Florida’s 1st District.\nAll three members donated to Dimmock through their leadership PACs;Joyce also donated from his campaign committee. Republican megadonor Harlan Crow and ex-Sen. John Danforth (R-Mo.) also donated to Dimmock, Federal Election Commission reports show.\nGaetz, who’s seeking a fifth term,engineered the ouster of Kevin McCarthy (R-Calif.) as speaker last fall.\nNegotiations aimed at winding down Israel’s nine-month war on Hamas in Gaza face four key sticking points, including which hostages should be released, according to people with knowledge of the talks.\nPresidentJoe Bidenis planning to unveil proposals that could dramatically reshape the Supreme Court, including term limits on justices who now sit on the court for life, according to a person familiar with the deliberations.\nThe Biden administration, facing pushback to its chip crackdown on China, has told allies that it’s considering using the most severe trade restrictions available if companies such as Tokyo Electron Ltd. and ASML Holding NV continue giving the country access to advanced semiconductor technology.\nGlobalWafers, a Taiwanese manufacturer of silicon wafers used in chip production, is in line to receive $400 million in US government help for projects in Texas and Missouri as part of the Biden administration’s signature Chips and Science Act.\nUS regulators should develop artificial intelligence tools to filter out robocalls as the next step in a broader effort to crack down on phone scams, the head of the FCC said Tuesday.\nThe landmark youth climate lawsuit that spanned three presidential administrations may be nearing its end while similar cases in the US and globally pick up the mantle.\nUS prosecutors indicted a former Central Intelligence Agency analyst specializing in North Korea on charges of working as an agent for South Korea after leaving the agency in exchange for luxury goods and other gifts.\nTo contact the reporters on this story:Brandon Leein Washington atblee@bgov.com;Jeannie Baumannin Washington atjbaumann@bloombergindustry.com\nTo contact the editors responsible for this story:Kayla Sharpeatksharpe@bloombergindustry.com;Giuseppe Macriatgmacri@bgov.com",
        "news_summary": "Donald Trump discussed his economic agenda and intentions for a potential second term in an interview with Bloomberg Businessweek. He emphasized low interest rates and taxes to boost the economy. The interview also touched on the political landscape, including the Republican Party's potential control of the White House and Congress. Security concerns around Trump have heightened due to an Iranian assassination plot. Trump’s running mate, JD Vance, signifies a shift towards trade protectionism. The article also covers various political dynamics, including donations to Trump’s campaign and Biden’s campaign strategies.",
        "news_sentiment": "Neutral",
        "news_keywords": [],
        "source_name": "bgov",
        "client_name": ""
    },
    {
        "news_url": "https://about.bgov.com/news/harris-working-to-wrangle-democrats-what-to-know-in-washington/",
        "news_title": "Harris Working to Wrangle Democrats: What to Know in Washington",
        "news_date": "July 22, 2024 7:16 AM",
        "news_content": "The pressure campaign todethrone Joe Bidenfrom the Democratic presidential ticketfinally won out. Now the fractured party has to figure outwho to take his place — and how— but first you should know:\nMany congressional Democrats already rallied behind Vice President Kamala Harris to cap the Democratic ticket in November — but notable holdouts and a short tenure in Congress mean its far from a lock.\nThe vice president’s first taskto formally secure the Democratic presidential nomination will be corralling former congressional colleagues. That could be a big task — Harris barely touched down in the Senate in 2017 before launching her first presidential bid. Additionally, Senate Majority Leader Chuck Schumer (N.Y.) and House Minority Leader Hakeem Jeffries (N.Y.) didn’t explicitly back Harris in statements Sunday.\nHarris wasted no time, making calls to Hill Democrats Sunday to shore up support. “This is a sprint,” Harris ally Sen. Laphonza Butler (D-Calif.) said in an interview. “She is making the calls to make sure that people know what she said in her statement: that she’s ready to earn this nomination.”\nThere’s no playbookfor Harris’ scenario. She’s been a supporting character in the Biden administration with a ding on he record for heading up Biden’s border policy as crossings at the US-Mexico border surged. Her voting record is cautiously centrist and her career as a prosecutor makes many progressives skeptical. Republicans will try to present her as a villain.Read More\nDemocrats are about to do something no party hassince primaries and caucuses replaced smoke-filled rooms as the method of selecting presidential nominees. By jettisoning a candidate who already clinched the nomination, they’re gambling a new ticket will energize a race that until lately seemed a numbing repeat of the past. Harris’s team was already contacting delegates Sunday to win them over to her side, according to people familiar with the effort.Read More\nPotential rivals,including Illinois Gov. J.B. Pritzker, focused their statements on praise for Biden without commenting on who his replacement should be. Michigan Gov. Gretchen Whitmer hasn’t yet endorsed Harris, but she doesn’t intend to compete for the nomination, said a person with knowledge of the matter. Pennsylvania Gov. Josh Shapiro and California Gov. Gavin Newsom both endorsed Harris, while some donors called for an open nominating process to determine the ticket.Read More\nBiden’s campaign still has nearly $96 millionleft in the bank. Harris can access to that cash. If another candidate emerges, that person would likely have to start fundraising from $0.Read More\nDemocrats raised more than $50 milliononline Sunday, since Biden announced his exit, according to a Bloomberg review of ActBlue data.Read More\nPotential for Lawsuits: In recent days Republicans suggested they could go to court to try and keep an alternate Democratic candidate off the ballot. Prior to Biden’s announcement, the conservative think tank The Heritage Foundation said it was plotting possible legal challenges.\nHow Biden’s exit will affect campaignsfor the House and Senate, who Harris might pick for her VP running mate, and what can still get done in Congress this year are the questions that will dominate Capitol Hill in the weeks to come.\nMeanwhile, Trump must now deal with a harsh reality:The 2024 race has gotten dramatically trickier. His campaign has been developing contingency plans to take on Harris, but those plans now have to address some fresh challenges.\nBIDEN’S SCHEDULE\nCONGRESS’ AGENDA\nBenjamin Netanyahu’s office said he’ll meet Biden in Washington tomorrow, a day before the Israeli prime minister is due to address a joint session of Congress. Efforts to bring an end to Israel’s nine-month war on Hamas are likely to top the agenda of Netanyahu’s visit.Read More\nHours after Biden announcedthat he won’t seek a second term, Blinken wrote on X that the president had restored US leadership around the world. The post was an unmistakable message to allies and adversaries that he has no intention of letting up on US efforts to broker an Israel-Hamas peace deal, press for more weapons and funding for Ukraine, and push back against Chinese support for Russian forces fighting there.Read More\nWorld leaders paid tribute to Biden yesterday,as the prospect of a second Trump administration has US allies in Europe bracing for a more abrasive and transactional foreign policy, with the focus away from Ukraine and with tariffs deployed as a geo-economic weapon on China and Europe.Read More\nBitcoin miners and crypto companies that have been stonewalled in efforts to go public in the US may ultimately be the biggest winners in the digital-asset world under a second Donald Trump presidency. Foreign companies at risk of losing market share may end up being the biggest losers.\nThe cryptocurrency industry is hoping the upcoming US presidential election will put someone in the White House who has a softer approach on enforcement, thereby ending prolonged battles with Wall Street’s top cop.\nDonald Trumphad what he called a “very good” telephone call with Ukrainian PresidentVolodymyr Zelenskiy, and again vowed to bring about a deal to end the war with Russia — though without saying how he’d do it.\nHunter Biden is asking courts in Delaware and California to throw out charges of tax evasion, afelony gun conviction,and other charges given a new ruling on President Donald Trump.\nThe US Secret Service’s embattled leader is about to field a barrage of questions from hostile lawmakers who want her out of a job after the attempted assassination of former PresidentDonald Trump.\nThe Department of Homeland Security declined the call for Cheatle to testify at a second oversight hearing on July 23, according to an agency official who spoke anonymously to discuss internal matters.\nFormer Homeland Secretary Janet Napolitano and Frances Townsend, a homeland security adviser to President George W. Bush, will lead an independent review of the July 13 shooting that injured former President Donald Trump.\nRepresentativeSheila Jackson Leeof Texas, who introduced legislation to make Juneteenth a national holiday, has died. She was 74.\nUS National Security Adviser Jake Sullivan said the US is preparing new sanctions on Chinese entities that support Russia’s war in Ukraine, and hinted that banks may be in the cross-hairs.\nThe White House boosted its forecasts for growth and inflation for 2024, while continuing to project outsize budget deficits for coming years.\nA tiny file ricocheted around the globe, exposing the global IT network’s fragility and the risks of industry consolidation.\nThe Biden administration on Monday will announce it’s awarding more than $4.3 billion to fund climate projects across the nation.\nThe landmark reversal comes as the Biden administration has been relying on broad existing statutes to address novel AI-driven threats involving impersonation, discrimination, and safety.\nTo contact the reporter on this story:Giuseppe Macriin Washington atgmacri@bgov.com\nTo contact the editor responsible for this story:Kayla Sharpeatksharpe@bloombergindustry.com",
        "news_summary": "Joe Biden has stepped down from the Democratic presidential ticket, leading to a scramble within the party to find a replacement. Vice President Kamala Harris is a leading contender but faces challenges due to her short tenure in Congress and mixed record. Democrats are taking an unprecedented step by replacing a candidate who had already secured the nomination, hoping to energize the race. Harris has begun rallying support from congressional colleagues and delegates. Potential rivals have praised Biden but have not commented on his replacement. The Democratic campaign has significant funds, and Harris can access these, while other candidates would need to start fundraising from scratch. Republicans may challenge the new Democratic candidate in court. Biden's exit raises questions about future campaigns and legislative actions. Meanwhile, Trump faces new challenges in the 2024 race. The article also touches on Biden's international efforts and the cryptocurrency industry's hopes for a softer regulatory approach under a potential Trump presidency.",
        "news_sentiment": "Neutral",
        "news_keywords": [
            "AI",
            "Artificial intelligence",
            "lawsuit"
        ],
        "source_name": "bgov",
        "client_name": ""
    },
    {
        "news_url": "https://about.bgov.com/news/what-to-know-in-washington-harris-sets-eyes-on-three-vp-picks/",
        "news_title": "What to Know in Washington: Harris Sets Eyes on Three VP Picks",
        "news_date": "July 29, 2024 7:16 AM",
        "news_content": "Vice President Kamala Harris’ campaign aides have narrowed their focus to three potential running mates — Mark Kelly, Josh Shaprio, and Tim Walz — who they hope can complement her strengths and cover her weaknesses on the campaign trail. But first, you should know:\nHarris hasnarrowed the gapwith Donald Trump, according to a range of polls. Additionally, her campaign has raised $200 million in her first week as a candidate.Biden plans to unveil a sweeping proposal today that wouldfundamentally alterthe Supreme Court.Trump is courting virtual currency enthusiasts with a pledge to fire SEC Chair Gary Gensler and pickcrypto-friendly regulatorsif he returns to the White House.\nVice President Kamala Harris is eyeing a trio of potential running mates as she faces a two-week dash to make the biggest decision of her nascent presidential bid.\nPeople familiar with the process say a short list has emergedwhich includes three elected officials with nationwide appeal: Arizona Sen. Mark Kelly, Pennsylvania Gov. Josh Shapiro, and Minnesota Gov. Tim Walz.\nPicking a vice presidential candidate will cementthe Democratic standard-bearers to take on Republican nominee Donald Trump and running mate JD Vance in November’s election. Harris’ sidekick can also serve as a force multiplier who can campaign and raise money on her behalf.Read More\nMeanwhile, Harris has narrowed the gap with Trump.Taken together, seven national surveys conducted since Biden stepped out of the race have cut the Democrats’ deficit about in half. Some closely watched polls — including a Wall Street Journal poll on Friday — have Harris in a statistical tie with Trump.Read More\nMassive Haul:Harris raised $200 million in her first week as a 2024 presidential contender.Read MoreFavorability Improves:Harris’ favorability rating surged to 43% from 35% a week ago, according to the survey based on a random national sample of 1,200 adults.Read More“Weird” Attack:Harris labeled comments by Trump and Vance “weird” at her first fundraiser since Biden stepped out of the presidential election, pursuing a line of attack that’s taken off among Democrats in the days since her ascent.Read MoreForeign Policy:After Harris met with Israeli Prime Minister Benjamin Netanyahu at the White House, her office quickly dispatched a memo to national security professionals highlighting her “strong record” on foreign policy.Read MoreFracking Reversal:Harris’ campaign said she doesn’t support a fracking ban, reversing a stance she took on the hot-button gas extraction method as a presidential candidate in 2019 as she vies to win over the fracking-reliant battleground of Pennsylvania.Read More\nBIDEN’S SCHEDULE\nHARRIS’ SCHEDULE\nCONGRESS’ AGENDA\nIn a speech today in Austin, Biden will call for binding ethics rules and term limits for Supreme Court justices to be passed by Congress as part of a proposal that would fundamentally alter the court.\nThe president’s planalso calls for a constitutional amendment to ensure that former presidents can be tried for crimes committed while in office.\nTerm Limits and Ethics Rules:Biden’s proposal would impose Supreme Court term limits through legislation, though many constitutional scholars say it would take a constitutional amendment. He’ll also urge lawmakers to pass enforceable rules of conduct that require justices to disclose gifts, refrain from political activity, and recuse themselves from cases presenting conflicts of interest — for them or spouses.\nJustice Elena Kagan last week floated the prospectof Chief Justice John Roberts appointing a panel of judges to oversee the standard adopted in November amid media and lawmaker scrutiny of gifts, paid travel, and other largesse received by Justice Clarence Thomas and other justices. The idea would likely would be toothless in practice, legal experts say.Read More\nDonald Trump said he would fire the Securities and Exchange Commission chair and pick crypto-friendly regulators if he returns to the White House in a bid to court virtual currency enthusiasts and harness the industry’s growing influence in the political arena.\nHis cowboy-and-superhero nonfungible tokens led Donald Trump down the digital-asset rabbit hole. He emerged as a crypto advocate, and now industry heavyweights are lining up to return him to the White House.\nThe cryptocurrency community has anxiously been awaiting a speech byDonald Trumpon Saturday, but his opponentRobert F. Kennedy Jr.may have stolen Trump’s thunder by announcing that the former president is considering the creation of a massive government reserve of Bitcoin should he return to the White House.\nDonald Trumpsaid he’s rebounded from an assassination attempt on July 13 and appeared on Friday night without a bandage on his right ear.\nBitGo Chief Executive OfficerMike Belshewill host a fundraiser forDonald Trump’s campaign headlined by the Republican nominee’s running mateJD Vance— the latest sign of the ticket’s appeal to prominent cryptocurrency executives.\nFive Democrats have raised at least $1 million as they try to be the one chosen to try to flip a swing seat in Arizona. Among them are a couple converted Republicans.\nThe House departed a week early for August recess, but GOP Ways and Means Committee lawmakers are taking tax issues on the road as they campaign in their districts during the annual respite Congress takes when Washington’s muggy weather sets in.\nUS SenatorMark Warnerhas introduced a bill that would require large and midsize banks to sign up for and test their ability to use the Federal Reserve’s discount window.\nThe US Justice Department said TikTok collected user information on sensitive topics, making it a national security threat that justifies a law to ban the popular social-media app in the US if its China-based parent company ByteDance Ltd. doesn’t divest.\nThe US military lacks the technology and capacity needed “to be confident it can deter and prevail in combat,” a congressionally-created commission will say in its final report to be released Monday.\nIn Kansas, where a prolonged drought has killed crops and eroded the soil, Gail Fuller’s farm is like an oasis. Sheep, cows and chickens graze freely on crops and vegetation in a paradisiacal mess.\nUS Treasury SecretaryJanet Yellentraveled Saturday to the mouth of the Amazon River, pitching the idea that fighting climate change would bolster economic growth in the region and across the globe.\nConservation groups and federal agencies are split about whether regulators’ approval of a federal land exchange that would allow an electric transmission line to cross a wildlife refuge complies with the Supreme Court’s decision to limit when courts defer to agency interpretations of laws.\nThe US and other world powers sought to prevent Israel and Hezbollah’s conflict turning into a full-blown war after a rocket attack that killed several children in the Israeli-occupied Golan Heights.\nThe US has “serious concerns” about the results of the election in Venezuela, Secretary of StateAntony Blinkensaid, calling for a detailed tabulation of votes afterNicolás Madurowas reelected as the nation’s president for six more years.\nTo contact the reporters on this story:Brandon Leein Washington atblee@bgov.com;Jeannie Baumannin Washington atjbaumann@bloombergindustry.com\nTo contact the editors responsible for this story:Kayla Sharpeatksharpe@bloombergindustry.com;Giuseppe Macriatgmacri@bgov.com",
        "news_summary": "Vice President Kamala Harris is considering three potential running mates: Mark Kelly, Josh Shapiro, and Tim Walz, as she narrows the gap with Donald Trump in the polls. Harris has raised $200 million in her first week as a candidate and improved her favorability rating. Biden plans to propose significant changes to the Supreme Court, including term limits and ethics rules. Trump is appealing to cryptocurrency enthusiasts by promising to appoint crypto-friendly regulators if re-elected. The article also covers various political activities and legislative proposals, including Biden's call for Supreme Court reforms and Trump's stance on cryptocurrency regulation.",
        "news_sentiment": "Neutral",
        "news_keywords": [],
        "source_name": "bgov",
        "client_name": ""
    },
    {
        "news_url": "https://about.bgov.com/news/harris-looks-to-expand-electoral-map-what-to-know-in-washington/",
        "news_title": "Harris Looks to Expand Electoral Map: What to Know in Washington",
        "news_date": "July 30, 2024 7:10 AM",
        "news_content": "Kamala Harris campaigns in Atlanta today, with just over a week left before Democratsformally nominate her— and her still-to-be named running mate. But first, you should know:\nHaving inherited a bleak electoral map from President Joe Biden, Vice President Kamala Harris is kicking off a push to compete against Donald Trump in a wider swath of battleground states with a rally today in Atlanta.\nEnjoying a burst of voter enthusiasmand campaign cash, the vice president is vying for Sun Belt states that Democrats had all but written off — Georgia, Arizona, and Nevada — as well as the Democrats’ so-called “Blue Wall” of Michigan, Wisconsin, and Pennsylvania.\nHarris’ campaign is confidentthat her relative popularity among key voting groups — including women, younger voters, and people of color — has helped expand the electoral map, according to people familiar with their thinking. Those groups had drifted from Biden but have gravitated to the new presumptive Democratic nominee.Read More\nMeanwhile, Harris’ campaign is on a sprint to vet a running mate.But one potential contender, North Carolina Gov. Roy Cooper, announced he is withdrawing from consideration.\nArizona Sen. Mark Kelly, Pennsylvania Gov. Josh Shapiro, and Minnesota Gov.Tim Walzare among those on Harris’short list, according to people familiar with the discussions.\nBIDEN’S SCHEDULE\nHARRIS’S SCHEDULE\nCONGRESS’ AGENDA\nMarianne Williamsonsaid she failed to meet the deadline to challenge Vice PresidentKamala Harrisfor the Democratic nomination, effectively ending her longshot bid.\nDonald Trumpsaid he expects to eventually debate Vice PresidentKamala Harris, the presumptive Democratic nominee, after previously declining to commit to appear at a scheduled face-off.\nBillionaire financier Ken Griffin is spending tens of millions of dollars to back Republican primary candidates across the US, but records show he has so far resisted contributing to Donald Trump — the former president leading an ideological overhaul of the GOP.\nThe US abolished slavery in 1865 with the ratification of the 13th Amendment. However, about two-thirds of people incarcerated in state and federal prisons work, and three-quarters report being forced to work or else to face punishment such as solitary confinement or the loss of vital privileges.\nBiden called yesterday for new binding ethics rules and term limits for Supreme Court Justices — a sweeping proposal that would fundamentally alter the top US court.\n“Extremism is undermining the public confidencein the court’s decisions,” Biden said at the Lyndon B. Johnson Presidential Library in Austin on Monday, casting the changes as necessary to restore accountability to both the presidency and the court.\nThe president said in recent years the court had “undermined long established civil rights principles, and protections,” citing decisions to overturnRoe v. Wade’sabortion rights protections, affirmative action at universities, and undermine enforcement of the Voting Rights Act.He assailed the court’s ruling this year that presidents enjoy some immunity for official acts, in a case involving Trump, calling it “a total affront to the basic expectations we have for those who wield the power in this nation.”\nBiden’s proposal, which faces a difficult path in Congress,also calls for a constitutional amendment to ensure that former presidents can be tried for crimes committed while in office. Speaker Mike Johnson (R-La.) called the plan “dead on arrival,” adding it “erode not only the rule of law, but the American people’s faith in our system of justice.”\nDemocrats have increasingly called for imposing limitson the Supreme Court after an ethics scandal and politically divisive rulings, including the conservative majority overturning Roe in 2022. However, lawmakers have seldom passed judicial reform laws in recent years.Read More\nQuickTake:Behind Biden’s Call for Changes to US Supreme Court\nThe bill’s advocates say the upcoming Senate vote has brought them long-awaited relief. But those feelings have dissipated quickly as attention shifts to the legislation’s fate in the House.\nMicrosoft Corp.is calling on Congress to pass a comprehensive law to crack down on images and audio created with artificial intelligence — known as deepfakes — that aim to interfere in elections or maliciously target individuals.\nSenate Majority Leader Chuck Schumer Monday teed up a Senate test vote on the long-stalled $78 billion business tax break bill, readying it for floor action later this week.\nSenate lawmakers confirmed Adam Landy to be a US Tax Court judge Monday, chipping away at the busy court’s vacancies.\nAnother attempt to limit federal agency power—this time by limiting Congress’ ability to delegate decisionmaking to regulators—was propelled by a federal appeals court’s ruling against an $8 billion-a-year FCC program intended to boost phone and broadband service for poor and rural communities.\nBusinesses worried about the cost of a federal requirement to report their owners’ identities see one lawsuit as a possible blueprint to escape enforcement—even as officials insist those concerns are misplaced.\nThe US has pledged an “unprecedented” level of defense funding to the Philippines amounting to $500 million, reinforcing an increasingly important alliance ahead of the US presidential election in November.\nThe EEOC’s renewed pass at a rule requiring companies to disclose employee pay data will encounter a legal and compliance landscape that’s changed since the agency’s first attempt in ways that stand to make the new regulation easier to successfully challenge.\nThe average monthly beneficiary premium for Medicare prescription drug coverage is expected to be $36.78 next year, or $2.08 more than in 2024, the Biden administration announced Monday.\nTo contact the reporters on this story:Brandon Leein Washington atblee@bgov.com;Jeannie Baumannin Washington atjbaumann@bloombergindustry.com\nTo contact the editors responsible for this story:Kayla Sharpeatksharpe@bloombergindustry.com;Giuseppe Macriatgmacri@bgov.com",
        "news_summary": "Kamala Harris is campaigning in Atlanta to expand the electoral map for Democrats, targeting key battleground states. Her campaign is confident due to her popularity among key voting groups. Meanwhile, Harris is vetting potential running mates, with some candidates withdrawing from consideration. Biden has proposed new ethics rules and term limits for Supreme Court Justices, citing recent controversial rulings. Microsoft is urging Congress to regulate AI-generated deepfakes. The US has pledged significant defense funding to the Philippines. The average Medicare prescription drug premium is set to increase next year.",
        "news_sentiment": "Neutral",
        "news_keywords": [
            "AI",
            "Artificial intelligence",
            "lawsuit",
            "proposed legislation"
        ],
        "source_name": "bgov",
        "client_name": ""
    }
]